{"1": {"title": "\n", "author": "Unknown", "poem": "\nThe HyperTexts\n\n\nThe Best Love Poems of All Time\r\nThe Best Romantic Poems Ever Written\r\nThe Best Valentine's Day Poems for that \"Special Someone\" \n\nWhich poets wrote the greatest love poems of all time? Selecting the \r\nbest love poems of all time has been \r\na \r\nmatter of personal taste and fancy. If you disagree with my choices, please feel \r\nfree to compile your own, but you may find poems here that \r\nmerit your consideration. Although most of the poems on this page are fairly \r\nrecent, I have included \"modernized\" translations of ancient classics such as \r\n\"Wulf and Eadwacer\" and William Dunbar's wonderful \"Sweet Rose of Virtue\" \r\nbecause many readers may not have read them, and that's a shame. I have also \r\nincluded translations of some of my favorite Urdu love poems, which are notable \r\nfor their highly romantic images and evocative metaphors.\n\r\nWho were the greatest love poets of the English language? In my opinion, for \r\nwhatever it's worth, the ten best love poets were Louise Bogan, Elizabeth Barrett Browning, Robert Burns, Hart Crane, e. e. cummings, \r\nEmily Dickinson, John Donne, Ernest Dowson, John Keats, William Shakespeare and William Butler Yeats. High honorable \r\nmentions go to William Blake, Lord Byron, Leonard Cohen, Robert Frost, Robert Herrick, Ben \r\nJonson, Christopher Marlowe, Edna St. Vincent Millay, Sylvia Plath, Christina Rossetti, Dante Gabriel Rossetti, \r\nPercy Bysshe Shelley \r\nand Walt Whitman. Great \r\nlove poets in other languages include Dante, Kahlil Gibran, Czeslaw Milosz, \r\nPablo Neruda, Ovid, Petrarch, Rumi, \r\nKing Solomon and Rabindranath Tagore. Who is the greatest love poet of \r\nall time? My vote goes to the first great lyric poet we know by name, Sappho of \r\nLesbos, whose erotic poems gave us the terms \"sapphic\" and \"lesbian.\"\r\n\n\ncompiled by Michael \r\nR. Burch\n\r\nPlease keep in mind that this page reflects one person's opinion, for whatever \r\nthat's worth ...\n\r\nRelated pages:\r\nThe Best Romantic Poetry,\r\nThe Best Erotic Poems,\r\nThe Best Urdu Love Poetry, \r\nThe Best Love Songs Ever\n\r\nIf you'd like to give someone special an out-of-the ordinary Valentine's Day \r\npresent, here's a love poem of mine that you're free to share:\n\nPassionate One\r\nby Michael R. Burch\n\r\nLove of my life,\r\nlight of my morning―\narise, brightly dawning,\r\nfor you are my sun. \n\r\nGive me of heaven\r\nboth manna and leaven―\r\ndesirous Presence,\nPassionate One.\n\r\nHere are two love poems by the great Persian poet Rumi:\n\r\nWhen I am with you, we stay up all night. \r\nWhen you're not here, I can't go to sleep. \r\nPraise God for these two insomnias! \r\nAnd the difference between them.\n―Jalaluddin Rumi, translation by Coleman Barks\n\r\nCome to the orchard in Spring. \r\nThere is light and wine, and sweethearts \r\nIn the pomegranate flowers. \r\nIf you do not come, these do not matter. \r\nIf you do come, these do not matter.\n―Jalaluddin Rumi, translation by Coleman Barks\n\r\nNow here, without further ado, are my top ten love poems of all time, recently \r\nexpanded to the top 25 love poems, with a few ties, followed by a number of high \r\nhonorable mentions ...\n\n#25 — Sappho, fragment 42\r\nloose translation by \r\nMichael R. Burch\n\r\nEros harrows my heart:\r\nwild winds whipping desolate mountains,\r\nuprooting oaks.\n\n\n\nGleyre Le Coucher de Sappho \r\nby Marc-Charles-Gabriel Gleyre\n\r\nSappho of Lesbos (circa 630-570 BC) is perhaps the first great female poet still known to us today, \r\nand she remains one of the very best poets of all time, regardless of gender. \r\nShe is so revered for her erotic love poetry that we get our terms \"sapphic\" and \"lesbian\" from her name \r\nand island of residence. And as you can see from the utterly stellar epigram above, \r\nshe remains a timeless treasure.\n\n\n\r\nWilliam Butler Yeats was the most famous Irish poet of all time, and his \r\nunrequited love for the beautiful and dangerous revolutionary Maud Gonne helped \r\nmake her almost as famous as he was in pre-independence Ireland. The moving poem below is Yeats' \r\nloose translation of a Ronsard poem, in which Yeats imagines the love of his \r\nlife in her later years, tending a fire that symbolizes the banked flames of a \r\nwaning love.\r\n\n\n\n\r\n#24 — When You Are Oldby William Butler Yeats\n\r\nWhen you are old and grey and full of sleep,\r\nAnd nodding by the fire, take down this book,\r\nAnd slowly read, and dream of the soft look\r\nYour eyes had once, and of their shadows deep;\n\r\nHow many loved your moments of glad grace,\r\nAnd loved your beauty with love false or true,\r\nBut one man loved the pilgrim soul in you,\r\nAnd loved the sorrows of your changing face;\n\r\nAnd bending down beside the glowing bars,\r\nMurmur, a little sadly, how Love fled\r\nAnd paced upon the mountains overhead\r\nAnd hid his face amid a crowd of stars.\n\n\n\n#23 —Requiescat\nby \r\nOscar Wilde\n\r\nTread lightly, she is near\r\nUnder the snow,\r\nSpeak gently, she can hear\r\nThe daisies grow.\n\r\nAll her bright golden hair\r\nTarnished with rust,\r\nShe that was young and fair\r\nFallen to dust.\n\r\nLily-like, white as snow,\r\nShe hardly knew\r\nShe was a woman, so\r\nSweetly she grew.\n\r\nCoffin-board, heavy stone,\r\nLie on her breast,\r\nI vex my heart alone,\r\nShe is at rest.\n\r\nPeace, Peace, she cannot hear\r\nLyre or sonnet,\r\nAll my life's buried here,\r\nHeap earth upon it.\n\r\nOscar Wilde's exquisitely lovely \"Requiescat\" is a wonderfully moving poem, and \r\none of the best elegies in the English language. Wilde wrote the poem for his \r\nyounger sister Isola, who died at age ten, when her brother was twelve. The poem \r\nwas written, or finished, seven years later, when Oscar Wilde was around age \r\nnineteen. The doctor who attended Isola in her illness described her as \"the \r\nmost gifted and lovable child\" he had ever seen. \"Ossie\" was at the time \"an \r\naffectionate, gentle, retiring, dreamy boy\" of twelve, at Portora School, whose \r\n\"lonely and inconsolable grief\" sought vent \"in long and frequent visits to his \r\nsister's grave in the village cemetery.\" \n\n#22 — How Do I Love Thee?\nby Elizabeth Barrett Browning\n\r\nHow do I love thee? Let me count the ways.\r\nI love thee to the depth and breadth and height\r\nMy soul can reach, when feeling out of sight\r\nFor the ends of Being and ideal Grace.\r\nI love thee to the level of every day's\r\nMost quiet need, by sun and candlelight.\r\nI love thee freely, as men strive for Right;\r\nI love thee purely, as they turn from Praise.\r\nI love with a passion put to use\r\nIn my old griefs, and with my childhood's faith.\r\nI love thee with a love I seemed to lose\r\nWith my lost saints,—I love thee with the breath,\r\nSmiles, tears, of all my life!—and, if God choose,\r\nI shall but love thee better after death.\n\r\nWhen\r\nElizabeth Barrett married Robert Browning, theirs became the \r\nmost famous coupling in the annals of English poetry. Her best-known book today \r\nis Sonnets from the Portuguese. \n\n\n\r\nElinor Wylie \"was famous during her life almost as much for her ethereal beauty \r\nand personality as for her melodious, sensuous poetry.\"\n\r\n#21 — Valentine\nby Elinor Wylie\nToo high, too high to pluck \r\nMy heart shall swing. \r\nA fruit no bee shall suck, \r\nNo wasp shall sting.\n\r\nIf on some night of cold \r\nIt falls to ground \r\nIn apple-leaves of gold \r\nI’ll wrap it round.\n\r\nAnd I shall seal it up \r\nWith spice and salt, \r\nIn a carven silver cup, \r\nIn a deep vault. \n\r\nBefore my eyes are blind \r\nAnd my lips mute, \r\nI must eat core and rind \r\nOf that same fruit. \n\r\nBefore my heart is dust \r\nAt the end of all, \r\nEat it I must, I must \r\nWere it bitter gall.\n\r\nBut I shall keep it sweet \r\nBy some strange art; \r\nWild honey I shall eat \r\nWhen I eat my heart. \n\r\nO honey cool and chaste \r\nAs clover’s breath! \r\nSweet Heaven I shall taste \r\nBefore my death.\n\n\n\r\nSylvia Plath was one of the first and best of the modern confessional poets. She \r\nwon a Pulitzer Prize posthumously for her Collected Poems after\r\ncommitting suicide at the age of 31, something she seemed to have been \r\npredicting in her writing and practicing for in real life.\n\n#20 — Mystic\r\nby Sylvia Plath \n\r\nThe air is a mill of hooks―\r\nQuestions without answer,\r\nGlittering and drunk as flies\r\nWhose kiss stings unbearably\r\nIn the fetid wombs of black air under pines in summer.\n\r\nI remember\r\nThe dead smell of sun on wood cabins,\r\nThe stiffness of sails, the long salt winding sheets.\r\nOnce one has seen God, what is the remedy?\r\nOnce one has been seized up\n\r\nWithout a part left over,\r\nNot a toe, not a finger, and used,\r\nUsed utterly, in the sun's conflagration, the stains\r\nThat lengthen from ancient cathedrals\r\nWhat is the remedy?\n\r\nThe pill of the Communion tablet,\r\nThe walking beside still water? Memory?\r\nOr picking up the bright pieces\r\nOf Christ in the faces of rodents,\r\nThe tame flower-nibblers, the ones\n\r\nWhose hopes are so low they are comfortable―\r\nThe humpback in his small, washed cottage\r\nUnder the spokes of the clematis.\r\nIs there no great love, only tenderness?\r\nDoes the sea\n\r\nRemember the walker upon it?\r\nMeaning leaks from the molecules.\r\nThe chimneys of the city breathe, the window sweats,\r\nThe children leap in their cots.\r\nThe sun blooms, it is a geranium.\n\r\nThe heart has not stopped.\n\n\n\r\nEdna St. Vincent Millay was the first woman to win a Pulitzer Prize for poetry. \r\nShe was openly bisexual and had affairs with other women and married men. When \r\nshe finally married, hers was an open marriage. Her 1920 poetry collection A \r\nFew Figs From Thistles drew controversy for its novel exploration of female \r\nsexuality. She was one of the earliest and strongest voices for what became \r\nknown as feminism. One of the recurring themes of her poetry was that men might \r\nuse her body, but not possess her or have any claim over her. (And perhaps that \r\ntheir desire for her body gave her the upper hand in relationships.) \n\n#19 — I, Being Born a Woman, and Distressedby Edna St. Vincent \r\nMillay\n\r\nI, being born a woman, and distressed\r\nBy all the needs and notions of my kind,\r\nAm urged by your propinquity to find\r\nYour person fair, and feel a certain zest\r\nTo bear your body's weight upon my breast:\r\nSo subtly is the fume of life designed,\r\nTo clarify the pulse and cloud the mind,\r\nAnd leave me once again undone, possessed. \r\n\r\nThink not for this, however, this poor treason\r\nOf my stout blood against my staggering brain,\r\nI shall remember you with love, or season\r\nMy scorn with pity — let me make it plain:\r\nI find this frenzy insufficient reason\r\nFor conversation when we meet again.\n\n\r\nAnne Sexton was a model who became a confessional \r\npoet, writing about intimate aspects of her life, after her doctor suggested \r\nthat she take up poetry as a form of therapy. She studied under Robert Lowell at \r\nBoston University, where Sylvia Plath was one of her classmates. Sexton won the \r\nPulitzer Prize for Poetry in 1967, but later committed suicide via carbon \r\nmonoxide poisoning. Topics she covered in her poems included adultery, \r\nmasturbation, menstruation, abortion, despair and suicide. The poem below is \r\nabout the love of the living for the dead, dedicated to her departed parents. \n\n\r\n#18 — The Truth the Dead Know\r\nby Anne Sexton\n\nFor my Mother, born March 1902, died March 1959\r\nand my Father, born February 1900, died June 1959\n\r\nGone, I say and walk from church,\r\nrefusing the stiff procession to the grave,\r\nletting the dead ride alone in the hearse.\r\nIt is June. I am tired of being brave.\n\r\nWe drive to the Cape. I cultivate\r\nmyself where the sun gutters from the sky,\r\nwhere the sea swings in like an iron gate\r\nand we touch. In another country people die.\n\r\nMy darling, the wind falls in like stones\r\nfrom the whitehearted water and when we touch\r\nwe enter touch entirely. No one's alone.\r\nMen kill for this, or for as much.\n\r\nAnd what of the dead? They lie without shoes\r\nin the stone boats. They are more like stone\r\nthan the sea would be if it stopped. They refuse\r\nto be blessed, throat, eye and knucklebone.\n\n\n#17 — \nCome Lord and Lift\r\nby T. Merrill\n\r\nCome Lord, and lift the fallen bird\r\n   Abandoned on the ground;\r\nThe soul bereft and longing so\r\n   To have the lost be found.\n\r\nThe heart that cries—let it but hear\r\n   Its sweet love answering,\r\nOr out of ether one faint note\r\n   Of living comfort wring.\n\r\n\"Come Lord and Lift\" is one of my favorite poems by a contemporary poet. \r\nIt's a wonderfully touching, moving poem about love and empathy for all life.\n\n\n\r\n#16 — After Paradise \nby Czeslaw Milosz\n\r\nDon't run any more. Quiet. How softly it rains\r\nOn the roofs of the city. How perfect\r\nAll things are. Now, for the two of you\r\nWaking up in a royal bed by a garret window.\r\nFor a man and a woman. For one plant divided\r\nInto masculine and feminine which longed for each other.\r\nYes, this is my gift to you. Above ashes\r\nOn a bitter, bitter earth. Above the subterranean\r\nEcho of clamorings and vows. So that now at dawn\r\nYou must be attentive: the tilt of a head,\r\nA hand with a comb, two faces in a mirror\r\nAre only forever once, even if unremembered,\r\nSo that you watch what it is, though it fades away,\r\nAnd are grateful every moment for your being.\r\nLet that little park with greenish marble busts\r\nIn the pearl-gray light, under a summer drizzle,\r\nRemain as it was when you opened the gate.\r\nAnd the street of tall peeling porticos\r\nWhich this love of yours suddenly transformed.\n\n\n#16 — \nLast Night \nby Faiz Ahmed Faiz\r\nloose translation by \r\nMichael R. Burch\nLast night, your memory stole into my heart—\r\nas spring sweeps uninvited into barren gardens,\r\nas morning breezes reinvigorate dormant deserts,\r\nas a patient suddenly feels better, for no apparent reason ...\n\n#16 — \nStrange Currents\nby Amir Khusrow\r\nloose translation by \r\nMichael R. Burch\nO Khusrow, the river of love\r\nexhibits strange tides—\r\nthe one who would swim in it invariably drowns,\r\nwhile the one who surrenders, survives. \n\r\nPercy Bysshe Shelley and Mary Wollstonecraft Shelley may have been the most notorious married \r\ncouple of their era. He was a dashing romantic poet and heretic who wrote a \r\ntract, \"The Necessity of Atheism,\" that got him expelled from Oxford. He also \r\nwrote in favor of nonviolence and against monarchies, \r\nimperialism and war. She was the daughter of one of the earliest feminist \r\nwriters of note, Mary Wollstonecraft, and the liberal philosopher William \r\nGodwin. In 1814, at age seventeen, she \r\nbecame romantically involved with Percy Shelley, who was married at the time but \r\nthreatened to commit suicide if she spurned his advances. They spent time \r\ntogether in France and Switzerland; when they returned, Mary was pregnant. Percy's wife Harriet, who was also pregnant, committed suicide in 1816; Percy \r\nand Mary married soon thereafter. The same year they spent the summer with Lord \r\nByron. It was at this time that Mary conceived the story that became her famous \r\ngothic novel Frankenstein. In 1822, Percy drowned at sea at age thirty. Who knows what he would \r\nhave accomplished if he had lived longer, but he is still considered to be one \r\nof the greatest English poets. Here is one especially lovely example of his \r\nwonderful touch with rhythm and rhyme:\n\n\n#15 — Music When Soft Voices Die (To \n—) \nby Percy Bysshe Shelley\n\r\nMusic, when soft voices die,\r\nVibrates in the memory—\r\nOdours, when sweet violets sicken,\r\nLive within the sense they quicken.\n\r\nRose leaves, when the rose is dead,\r\nAre heaped for the belovèd's bed;\r\nAnd so thy thoughts, when thou art gone,\r\nLove itself shall slumber on.\n\n\r\n#14 —A Red, Red Rose\n\r\nby Robert Burns\n\n\r\nOh my luve is like a red, red rose,\r\nThat's newly sprung in June:\r\nOh my luve is like the melodie,\r\nThat's sweetly play'd in tune.\n\r\nAs fair art thou, my bonie lass,\r\nSo deep in luve am I;\r\nAnd I will luve thee still, my dear,\r\nTill a' the seas gang dry.\n\r\nTill a' the seas gang dry, my dear,\r\nAnd the rocks melt wi' the sun;\r\nAnd I will luve thee still, my dear,\r\nWhile the sands o' life shall run.\n\r\nAnd fare thee weel, my only luve!\r\nAnd fare thee weel a while!\r\nAnd I will come again, my luve,\r\nTho' it were ten thousand mile!\n\r\nRobert Burns was one of the great early Romantics, perhaps a forerunner of both \r\nShelley and Clare. \r\nDespite the fact that he wrote in a Scots-English dialect, he still reads well today. \r\nHe is, of course, most famous for his nostalgic drinking song \"Auld Lang Syne.\" \r\nWhen Bob Dylan was asked to name the work of art that had the greatest impact on \r\nhis own artistic life, he named the poem above.\n\r\nSir Thomas Wyatt has been credited with introducing the \r\nPetrarchan sonnet into the English language. His father, Henry Wyatt, had been one of Henry \r\nVII's Privy Councilors, and remained a trusted adviser when Henry VIII came to \r\nthe throne in 1509. Thomas Wyatt followed his father to court. But it seems the \r\nyoung poet may have fallen in love with the king’s mistress. Many legends and \r\nconjectures suggest that an unhappily married Wyatt had a relationship with \r\nAnne Boleyn. Their acquaintance is certain, but whether or not the two \r\nactually shared a romantic relationship remains unknown. But in his poetry, Wyatt called \r\nhis mistress Anna, and sometimes embedded pieces of information that seem to correspond with \r\nher life. For instance, this poem might well have been written \r\nabout the King’s claim on Anne Boleyn: \n\n#13 —  Whoso List to Hunt\r\nby Sir Thomas Wyatt\n\r\nWhoso list to hunt, I know where is an hind,\r\nBut as for me, alas, I may no more.\r\nThe vain travail hath wearied me so sore,\r\nI am of them that farthest cometh behind.\r\nYet may I by no means my wearied mind\r\nDraw from the deer, but as she fleeth afore\r\nFainting I follow. I leave off therefore,\r\nSince in a net I seek to hold the wind.\r\nWho list her hunt, I put him out of doubt,\r\nAs well as I may spend his time in vain.\r\nAnd graven with diamonds in letters plain\r\nThere is written, her fair neck round about:\nNoli me tangere, for Caesar's I am,\r\nAnd wild for to hold, though I seem tame. \n\nNoli me tangere means \"Touch me not.\" According to the Bible, this is \r\nwhat Jesus said to Mary Magdalene when she tried to embrace him after the \r\nresurrection. So perhaps after her betrothal to Henry, religious vows also \r\nentered into the picture, and left Wyatt out.\n\n\n#12 —  They Flee from Me\r\nby Sir Thomas Wyatt\n\r\nThey flee from me that sometime did me seek\r\nWith naked foot stalking in my chamber.\r\nI have seen them gentle tame and meek\r\nThat now are wild and do not remember\r\nThat sometime they put themselves in danger\r\nTo take bread at my hand; and now they range\r\nBusily seeking with a continual change.\n\r\nThanked be fortune, it hath been otherwise\r\nTwenty times better; but once in special,\r\nIn thin array after a pleasant guise,\r\nWhen her loose gown from her shoulders did fall,\r\nAnd she me caught in her arms long and small;\r\nAnd therewithal sweetly did me kiss,\r\nAnd softly said, Dear heart, how like you this?\n\r\nIt was no dream, I lay broad waking.\r\nBut all is turned thorough my gentleness\r\nInto a strange fashion of forsaking;\r\nAnd I have leave to go of her goodness\r\nAnd she also to use newfangleness.\r\nBut since that I so kindly am served,\r\nI would fain know what she hath deserved.\n\n\n#11 —  Sweet Rose of Virtue\r\nby William Dunbar\r\nloose translation by Michael R. Burch\n\r\nSweet rose of virtue and of gentleness,\r\ndelightful lily of youthful wantonness,\r\nrichest in bounty and in beauty clear\r\nand in every virtue that is held most dear―\nexcept only that you are merciless.\n\r\nInto your garden, today, I followed you;\r\nthere I saw flowers of freshest hue,\r\nboth white and red, delightful to see,\r\nand wholesome herbs, waving resplendently―\nyet everywhere, no odor but bitter rue.\n\r\nI fear that March with his last arctic blast\r\nhas slain my fair rose of pallid and gentle cast,\r\nwhose piteous death does my heart such pain\r\nthat, if I could, I would compose her roots again―\nso comforting her bowering leaves have been.\n\r\nWilliam Dunbar's wonderful \"Sweet Rose of Virtue\" is another of my favorite poems from the early days of English poetry. I chose to \r\ntranslate it myself, to make it more accessible to modern readers.\n\n\n\r\n#10 — La Figlia Che Piange (The Weeping Girl)\r\nby T. S. Eliot\n\r\nStand on the highest pavement of the stair —\r\nLean on a garden urn —\r\nWeave, weave the sunlight in your hair —\r\nClasp your flowers to you with a pained surprise —\r\nFling them to the ground and turn\r\nWith a fugitive resentment in your eyes:\r\nBut weave, weave the sunlight in your hair.\n\r\nSo I would have had him leave,\r\nSo I would have had her stand and grieve,\r\nSo he would have left\r\nAs the soul leaves the body torn and bruised,\r\nAs the mind deserts the body it has used.\r\nI should find\r\nSome way incomparably light and deft,\r\nSome way we both should understand,\r\nSimple and faithless as a smile and a shake of the hand.\n\r\nShe turned away, but with the autumn weather\r\nCompelled my imagination many days,\r\nMany days and many hours:\r\nHer hair over her arms and her arms full of flowers.\r\nAnd I wonder how they should have been together!\r\nI should have lost a gesture and a pose.\r\nSometimes these cogitations still amaze\r\nThe troubled midnight, and the noon's repose.\n\r\nAlong with Ezra Pound, T. S. Eliot helped create modern free verse. This poem \r\ndemonstrates his his remarkable talents. While Eliot was a sophisticated, urbane \r\npoet, his main theme was human love, and he often comes across as a somewhat \r\n\"nerdy,\" disillusioned romantic. \n\n\n#9 — To Earthward by Robert Frost\n\r\nLove at the lips was touch\r\nAs sweet as I could bear;\r\nAnd once that seemed too much;\r\nI lived on air\n\r\nThat crossed me from sweet things,\r\nThe flow of — was it musk\r\nFrom hidden grapevine springs\r\nDownhill at dusk?\n\r\nI had the swirl and ache\r\nFrom sprays of honeysuckle\r\nThat when they’re gathered shake\r\nDew on the knuckle.\n\r\nI craved strong sweets, but those\r\nSeemed strong when I was young:\r\nThe petal of the rose\r\nIt was that stung.\n\r\nNow no joy but lacks salt,\r\nThat is not dashed with pain\r\nAnd weariness and fault;\r\nI crave the stain\n\r\nOf tears, the aftermark\r\nOf almost too much love,\r\nThe sweet of bitter bark\r\nAnd burning clove.\n\r\nWhen stiff and sore and scarred\r\nI take away my hand\r\nFrom leaning on it hard\r\nIn grass or sand,\n\r\nThe hurt is not enough:\r\nI long for weight and strength\r\nTo feel the earth as rough\r\nTo all my length.\n\r\nIt's hard to imagine a better-written love poem than Robert Frost's \"To \r\nEarthward,\" and yet we still have five higher spots to go ...\n\n\n#8 — Song For The Last Act\r\nby Louise Bogan\n\r\nNow that I have your face by heart, I look\r\nLess at its features than its darkening frame\r\nWhere quince and melon, yellow as young flame,\r\nLie with quilled dahlias and the shepherd's crook.\r\nBeyond, a garden. There, in insolent ease\r\nThe lead and marble figures watch the show\r\nOf yet another summer loath to go\r\nAlthough the scythes hang in the apple trees.\n\r\nNow that I have your face by heart, I look.\n\r\nNow that I have your voice by heart, I read\r\nIn the black chords upon a dulling page\r\nMusic that is not meant for music's cage,\r\nWhose emblems mix with words that shake and bleed.\r\nThe staves are shuttled over with a stark\r\nUnprinted silence. In a double dream\r\nI must spell out the storm, the running stream.\r\nThe beat's too swift. The notes shift in the dark.\n\r\nNow that I have your voice by heart, I read.\n\r\nNow that I have your heart by heart, I see\r\nThe wharves with their great ships and architraves;\r\nThe rigging and the cargo and the slaves\r\nOn a strange beach under a broken sky.\r\nO not departure, but a voyage done!\r\nThe bales stand on the stone; the anchor weeps\r\nIts red rust downward, and the long vine creeps\r\nBeside the salt herb, in the lengthening sun.\n\r\nNow that I have your heart by heart, I see.\n\r\nLouise Bogan's magnificent \"Song for the Last Act\" is an absolutely wonderful \r\npoem about love toward the end of one's life, or a couple's lives.\n\n\n#7 — Bread and Music\nby Conrad Aiken\n\r\nMusic I heard with you was more than music,\r\nAnd bread I broke with you was more than bread;\r\nNow that I am without you, all is desolate;\r\nAll that was once so beautiful is dead.\n\r\nYour hands once touched this table and this silver,\r\nAnd I have seen your fingers hold this glass.\r\nThese things do not remember you, belovèd,\r\nAnd yet your touch upon them will not pass.\n\r\nFor it was in my heart you moved among them,\r\nAnd blessed them with your hands and with your eyes;\r\nAnd in my heart they will remember always,—\r\nThey knew you once, O beautiful and wise.\n\r\nConrad Aiken, in his best poems, rivals Wallace Stevens and Hart Crane as masters of modern English poetic meter. Aiken's \"Bread and \r\nMusic\" is one of my very favorite poems, regardless of era.\n\n\n#6 — Piano\nby D. H. Lawrence\n\r\nSoftly, in the dusk, a woman is singing to me;\r\nTaking me back down the vista of years, till I see\r\nA child sitting under the piano, in the boom of the tingling strings\r\nAnd pressing the small, poised feet of a mother who smiles as she sings.\r\n\r\nIn spite of myself, the insidious mastery of song\r\nBetrays me back, till the heart of me weeps to belong\r\nTo the old Sunday evenings at home, with winter outside\r\nAnd hymns in the cozy parlor, the tinkling piano our guide.\r\n\r\nSo now it is vain for the singer to burst into clamor\r\nWith the great black piano appassionato.  The glamour\r\nOf childish days is upon me, my manhood is cast\r\nDown in the flood of remembrance, I weep like a child for the past.\n\n#5 — \nNon sum qualis eram bonae sub regno Cynarae\r\nby Ernest Dowson\n\n\"I am not as I was under the reign of the good Cynara\"—Horace\n\r\nLast night, ah, yesternight, betwixt her lips and mine\r\n\r\nThere fell thy shadow, Cynara! thy breath was shed\r\nUpon my soul between the kisses and the wine;\r\nAnd I was desolate and sick of an old passion,\r\nYea, I was desolate and bowed my head:\r\nI have been faithful to thee, Cynara! in my fashion.\n\r\nAll night upon mine heart I felt her warm heart beat,\r\nNight-long within mine arms in love and sleep she lay;\r\nSurely the kisses of her bought red mouth were sweet;\r\nBut I was desolate and sick of an old passion,\r\nWhen I awoke and found the dawn was gray:\r\nI have been faithful to you, Cynara! in my fashion.\n\r\nI have forgot much, Cynara! gone with the wind,\r\nFlung roses, roses riotously with the throng,\r\nDancing, to put thy pale, lost lilies out of mind;\r\nBut I was desolate and sick of an old passion,\r\nYea, all the time, because the dance was long;\r\nI have been faithful to thee, Cynara! in my fashion.\n\r\nI cried for madder music and for stronger wine,\r\nBut when the feast is finished and the lamps expire,\r\nThen falls thy shadow, Cynara! the night is thine;\r\nAnd I am desolate and sick of an old passion,\r\nYea, hungry for the lips of my desire:\r\nI have been faithful to thee, Cynara! in my fashion.\n\r\nErnest Dowson's influence on T. S. Eliot is obvious, and anyone who reads his best poems can easily understand the attraction. Other writers \r\nunabashedly \"borrowed\" phrases from Dowson: \"gone with the wind,\" \"the days of wine and roses,\" \"hollow \r\nlands,\" etc. The best poets write memorable lines, and Dowson's best poems are full of memorable lines. Several of his poems can be found \r\non the Masters page of The HyperTexts.\n\n\n#4 — Lullaby\nby W. H. Auden\n\r\nLay your sleeping head, my love,\r\nHuman on my faithless arm:\r\nTime and fevers burn away\r\nIndividual beauty from\r\nThoughtful children, and the grave\r\nProves the child ephemeral:\r\nBut in my arms till break of day\r\nLet the living creature lie,\r\nMortal, guilty, but to me\r\nThe entirely beautiful.\n\r\nSoul and body have no bounds:\r\nTo lovers as they lie upon\r\nHer tolerant enchanted slope\r\nIn their ordinary swoon,\r\nGrave the vision Venus sends\r\nOf supernatural sympathy,\r\nUniversal love and hope;\r\nWhile an abstract insight wakes\r\nAmong the glaciers and the rocks\r\nThe hermit's carnal ecstasy.\n\r\nCertainty, fidelity\r\nOn the stroke of midnight pass\r\nLike vibrations of a bell\r\nAnd fashionable madmen raise\r\nTheir pedantic boring cry:\r\nEvery farthing of the cost.\r\nAll the dreaded cards foretell.\r\nShall be paid, but from this night\r\nNot a whisper, not a thought.\r\nNot a kiss nor look be lost.\n\r\nBeauty, midnight, vision dies:\r\nLet the winds of dawn that blow\r\nSoftly round your dreaming head\r\nSuch a day of welcome show\r\nEye and knocking heart may bless,\r\nFind our mortal world enough;\r\nNoons of dryness find you fed\r\nBy the involuntary powers,\r\nNights of insult let you pass\r\nWatched by every human love.\n\r\nAuden's \"Lullaby\" is one of the truly great poems in the English language. His elegy to William Butler Yeats is another.\n\n#3 — Go, Lovely Rose\nby Edmund Waller\r\n\n\r\n     Go, lovely Rose,—\r\nTell her that wastes her time and me,\r\n     That now she knows,\r\nWhen I resemble her to thee,\r\nHow sweet and fair she seems to be.\n\r\n     Tell her that's young,\r\nAnd shuns to have her graces spied,\r\n     That hadst thou sprung\r\nIn deserts where no men abide,\r\nThou must have uncommended died.\n\r\n     Small is the worth\r\nOf beauty from the light retir'd:\r\n     Bid her come forth,\r\nSuffer herself to be desir'd,\r\nAnd not blush so to be admir'd.\n\r\n     Then die, that she\r\nThe common fate of all things rare\r\n     May read in thee;\r\nHow small a part of time they share,\r\nThat are so wondrous sweet and fair.\n\n\"Go, Lovely Rose\" is a picture-perfect carpe diem (\"seize the day\") poem. \r\nOther famous love poems that \"advise\" virgins to hop into bed with the poet \r\ninclude \"To His Coy Mistress\" by Andrew Marvell, \"To the Virgins, to Make Much \r\nof Time\" and \"To Daffodils\" by Robert Herrick, \"Sweet Rose of \r\nVirtue\" by William Dunbar and \"When I Was One-and-Twenty\" by \r\nA. E. Housman. But in my opinion, this poem is just as clever, and more beautiful than \r\nany of its competitors. \n\n\n#2 — Cradle Song by William Blake\n\r\nSleep, sleep, beauty bright,\r\nDreaming in the joys of night;\r\nSleep, sleep; in thy sleep\r\nLittle sorrows sit and weep.\n\r\nSweet babe, in thy face\r\nSoft desires I can trace,\r\nSecret joys and secret smiles,\r\nLittle pretty infant wiles.\n\r\nAs thy softest limbs I feel\r\nSmiles as of the morning steal\r\nO'er thy cheek, and o'er thy breast\r\nWhere thy little heart doth rest.\n\r\nO the cunning wiles that creep\r\nIn thy little heart asleep!\r\nWhen thy little heart doth wake,\r\nThen the dreadful night shall break.\n\n Auden's \"Lullaby\" was written from one adult to another. Blake's \r\n\"Cradle Song\" is a lullaby written by an adult to a sleeping baby. Blake was \r\nmarried but never had children, as far as we know, yet his love and compassion \r\nfor the nameless sleeping baby are wonderfully evident in this very moving poem.\r\n\n\n\n#1 — \nVoyages\nby Hart Crane\n\r\nI\n\r\nAbove the fresh ruffles of the surf\r\nBright striped urchins flay each other with sand. \r\n\r\nThey have contrived a conquest for shell shucks, \r\n\r\nAnd their fingers crumble fragments of baked weed \r\n\r\nGaily digging and scattering.\n\r\nAnd in answer to their treble interjections \r\n\r\nThe sun beats lightning on the waves,\r\nThe waves fold thunder on the sand;\r\nAnd could they hear me I would tell them: \r\n\n\r\nO brilliant kids, frisk with your dog,\r\nFondle your shells and sticks, bleached\r\nBy time and the elements; but there is a line \r\n\r\nYou must not cross nor ever trust beyond it \r\n\r\nSpry cordage of your bodies to caresses\r\nToo lichen-faithful from too wide a breast. \r\n\r\nThe bottom of the sea is cruel.\n\r\nII\n\r\n—And yet this great wink of eternity,\r\nOf rimless floods, unfettered leewardings, \r\n\r\nSamite sheeted and processioned where\r\nHer undinal vast belly moonward bends,\r\nLaughing the wrapt inflections of our love; \r\n\n\r\nTake this Sea, whose diapason knells\r\nOn scrolls of silver snowy sentences,\r\nThe sceptred terror of whose sessions rends \r\n\r\nAs her demeanors motion well or ill,\r\nAll but the pieties of lovers’ hands.\n\r\nAnd onward, as bells off San Salvador\r\nSalute the crocus lustres of the stars,\r\nIn these poinsettia meadows of her tides,— \r\n\r\nAdagios of islands, O my Prodigal,\r\nComplete the dark confessions her veins spell. \r\n\n\r\nMark how her turning shoulders wind the hours, \r\n\r\nAnd hasten while her penniless rich palms \r\n\r\nPass superscription of bent foam and wave,— \r\n\r\nHasten, while they are true,—sleep, death, desire, \r\n\r\nClose round one instant in one floating flower. \r\n\n\r\nBind us in time, O Seasons clear, and awe. \r\n\r\nO minstrel galleons of Carib fire,\r\nBequeath us to no earthly shore until\r\nIs answered in the vortex of our grave\r\nThe seal’s wide spindrift gaze toward paradise. \r\n\n\r\nIII\n\r\nInfinite consanguinity it bears—\r\nThis tendered theme of you that light\r\nRetrieves from sea plains where the sky\r\nResigns a breast that every wave enthrones; \r\n\r\nWhile ribboned water lanes I wind\r\nAre laved and scattered with no stroke\r\nWide from your side, whereto this hour\r\nThe sea lifts, also, reliquary hands.\n\r\nAnd so, admitted through black swollen gates\r\nThat must arrest all distance otherwise,—\r\nPast whirling pillars and lithe pediments,\r\nLight wrestling there incessantly with light,\r\nStar kissing star through wave on wave unto\r\nYour body rocking!\r\nand where death, if shed,\r\nPresumes no carnage, but this single change,—\r\nUpon the steep floor flung from dawn to dawn\r\nThe silken skilled transmemberment of song;\n\r\nPermit me voyage, love, into your hands ...\n\r\nIV\n\r\nWhose counted smile of hours and days, suppose\r\nI know as spectrum of the sea and pledge\r\nVastly now parting gulf on gulf of wings\r\nWhose circles bridge, I know, (from palms to the severe \r\n\r\nChilled albatross’s white immutability)\r\nNo stream of greater love advancing now\r\nThan, singing, this mortality alone\r\nThrough clay aflow immortally to you.\n\r\nAll fragrance irrefragably, and claim\r\nMadly meeting logically in this hour\r\nAnd region that is ours to wreathe again,\r\nPortending eyes and lips and making told\r\nThe chancel port and portion of our June—\n\r\nShall they not stem and close in our own steps\r\nBright staves of flowers and quills today as I\r\nMust first be lost in fatal tides to tell?\n\r\nIn signature of the incarnate word\r\nThe harbor shoulders to resign in mingling\r\nMutual blood, transpiring as foreknown\r\nAnd widening noon within your breast for gathering\r\nAll bright insinuations that my years have caught\r\nFor islands where must lead inviolably\r\nBlue latitudes and levels of your eyes,—\n\r\nIn this expectant, still exclaim receive\r\nThe secret oar and petals of all love.\n\r\nV\n\r\nMeticulous, past midnight in clear rime,\r\nInfrangible and lonely, smooth as though cast\r\nTogether in one merciless white blade—\r\nThe bay estuaries fleck the hard sky limits.\n\r\n—As if too brittle or too clear to touch!\r\nThe cables of our sleep so swiftly filed,\r\nAlready hang, shred ends from remembered stars.\r\nOne frozen trackless smile ... What words\r\nCan strangle this deaf moonlight? For we\n\r\nAre overtaken. Now no cry, no sword\r\nCan fasten or deflect this tidal wedge,\r\nSlow tyranny of moonlight, moonlight loved\r\nAnd changed ... “There’s\n\r\nNothing like this in the world,” you say,\r\nKnowing I cannot touch your hand and look\r\nToo, into that godless cleft of sky\r\nWhere nothing turns but dead sands flashing.\n\r\n“—And never to quite understand!” No,\r\nIn all the argosy of your bright hair I dreamed\r\nNothing so flagless as this piracy.\n\r\nBut now\r\nDraw in your head, alone and too tall here.\r\nYour eyes already in the slant of drifting foam;\r\nYour breath sealed by the ghosts I do not know:\r\nDraw in your head and sleep the long way home.\n\r\nVI\n\r\nWhere icy and bright dungeons lift\r\nOf swimmers their lost morning eyes,\r\nAnd ocean rivers, churning, shift\r\nGreen borders under stranger skies,\n\r\nSteadily as a shell secretes\r\nIts beating leagues of monotone,\r\nOr as many waters trough the sun’s\r\nRed kelson past the cape’s wet stone;\n\r\nO rivers mingling toward the sky\r\nAnd harbor of the phoenix’ breast—\r\nMy eyes pressed black against the prow,\r\n—Thy derelict and blinded guest\n\r\nWaiting, afire, what name, unspoke,\r\nI cannot claim: let thy waves rear\r\nMore savage than the death of kings,\r\nSome splintered garland for the seer.\n\r\nBeyond siroccos harvesting\r\nThe solstice thunders, crept away,\r\nLike a cliff swinging or a sail\r\nFlung into April’s inmost day—\n\r\nCreation’s blithe and petalled word\r\nTo the lounged goddess when she rose\r\nConceding dialogue with eyes\r\nThat smile unsearchable repose—\n\r\nStill fervid covenant, Belle Isle,\r\n—Unfolded floating dais before\r\nWhich rainbows twine continual hair—\r\nBelle Isle, white echo of the oar!\n\r\nThe imaged Word, it is, that holds\r\nHushed willows anchored in its glow.\r\nIt is the unbetrayable reply\r\nWhose accent no farewell can know.\n\r\nIn my opinion, Hart Crane's \"Voyages\" is the best love poem of all time, and the \r\nsecond-best love poem isn't even close. Hart Crane was an \"uneven\" poet who \r\nsometimes borders on being unreadable, but in his best poems, he is a wonder. \r\nOther poems of his such as \"To Brooklyn Bridge\" and \"The Broken Tower\" rank with \r\nthe best poems in the English language.\n\r\nThese are my high honorable mentions ...\n\nExcerpt from The Song of Songs\nattributed to King Solomon\n\r\nI am the rose of Sharon, and the lily of the valleys.\r\nAs the lily among thorns, so is my love among the daughters.\r\nAs the apple tree among the trees of the wood, so is my beloved among the sons.\r\nI sat down under his shadow with great delight, and his fruit was sweet to my taste.\r\nHe brought me to the banqueting house, and his banner over me was love.\r\nStay me with flagons, comfort me with apples: for I am sick of love.\r\nHis left hand is under my head, and his right hand doth embrace me.\r\nI charge you, O ye daughters of Jerusalem, by the roes,\r\nand by the hinds of the field, that ye stir not up, nor wake my love, till he please.\n\r\nWho'd have thought to look for erotic poetry in the Bible? But the \"Song of \r\nSongs\" (also known as the \"Song of Solomon\") remains one of the sexiest poems of \r\nall time. \n\n\r\nDo not stand at my grave and weep\r\nby Mary Elizabeth Frye\n\r\nDo not stand at my grave and weep:\r\nI am not there; I do not sleep.\r\nI am a thousand winds that blow,\r\nI am the diamond glints on snow,\r\nI am the sun on ripened grain,\r\nI am the gentle autumn rain.\r\nWhen you awaken in the morning’s hush\r\nI am the swift uplifting rush\r\nOf quiet birds in circling flight.\r\nI am the soft starshine at night.\r\nDo not stand at my grave and cry:\r\nI am not there; I did not die.\n\r\nThis consoling elegy had a \r\nvery mysterious genesis, as it was written by Mary Elizabeth Frye, a \r\nBaltimore housewife who lacked a formal education, having been orphaned at age \r\nthree. She had never written poetry before. Frye wrote the poem on a ripped-off piece of a brown grocery bag, \r\nin a burst of compassion for a Jewish girl who had fled the Holocaust  \r\nonly to receive news that her mother had died in Germany. The girl was \r\nweeping inconsolably because she couldn't visit her mother's grave to share her \r\ntears of love and bereavement. When the poem was named Britain's \r\nmost popular poem in a 1996 Bookworm poll, with more than 30,000 \r\ncall-in votes despite not having been one of the critics' \r\nnominations, an unlettered orphan girl had seemingly surpassed all England's \r\nmany cultured and degreed ivory towerists in the public's estimation. Although the poem's \r\norigin was disputed for some time (it had been attributed to Native American and other sources), \r\nFrye's authorship was confirmed in 1998 after investigative research by Abigail \r\nVan Buren, the newspaper columnist better known as \"Dear Abby.\" The poem has \r\nalso been called \"I Am\" due to its rather biblical repetitions of the phrase. \r\nFrye never formally published or copyrighted the poem, so we believe it is in \r\nthe public domain and can be shared, although we recommend that it not be used \r\nfor commercial purposes, since Frye never tried to profit from it herself. \n\n\nFriday\n\nby Ann Drysdale\n\r\nThe print of a bare foot, the second toe\r\nA little longer than the one which is\r\nTraditionally designated \"great\".\r\nPraxiteles would have admired it.\n\r\nYou must have left in haste; your last wet step\r\nBefore boarding your suit and setting sail,\r\nOutlined in talcum on the bathroom floor\r\nMocks your habitual fastidiousness.\n\r\nThere is no tide here to obliterate\r\nYour oversight. Unless I wipe or sweep\r\nOr suck it up, it will not go away.\r\nThe thought delights me. I will keep the footprint.\n\r\nToo slight, too simply human to be called\r\nToken or promise; I am keeping it\r\nBecause it is a precious evidence\r\nThat on this island I am not alone.\n\r\nAnn Drysdale is one of our better contemporary poets, in my opinion.\n\nValentine\r\nby Carol Ann Duffy \n\r\nNot a red rose or a satin heart.\n\r\nI give you an onion.\r\nIt is a moon wrapped in brown paper.\r\nIt promises light\r\nlike the careful undressing of love.\n\r\nHere.\r\nIt will blind you with tears\r\nlike a lover.\r\nIt will make your reflection\r\na wobbling photo of grief.\n\r\nI am trying to be truthful.\n\r\nNot a cute card or a kissogram.\n\r\nI give you an onion.\r\nIts fierce kiss will stay on your lips,\r\npossessive and faithful\r\nas we are,\r\nfor as long as we are.\n\r\nTake it.\r\nIts platinum loops shrink to a wedding-ring,\r\nif you like.\n\r\nLethal.\r\nIts scent will cling to your fingers,\r\ncling to your knife.\n\nThe Raiment We Put On\nby Kelly Cherry\n\r\nDo you remember? We were in a room\r\nWith walls as warm as anybody’s breath,\r\nAnd music wove us on its patterning loom,\r\nThe complicated loom of life and death.\r\nYour hands moved over my face like small clouds.\r\n(Rain fell into a river and sank, somewhere.)\r\nI moved among your fingers, brushed by the small crowds\r\nOf them, feeling myself known, everywhere,\r\nAnd in that desperate country so far from here,\r\nI heard you say my name over and over,\r\nYour voice threading its way into my ear.\r\nI will spend my days working to discover\r\nThe pattern and its meaning, what you meant,\r\nWhat has been raveled and what has been rent.\n\nA Quoi Bon Dire (\"What Good is there to Say\")\r\nby\r\nCharlotte Mew\n\r\nSeventeen years ago you said\r\nSomething that sounded like Good-bye;\r\nAnd everybody thinks that you are dead,\r\nBut I.\n\r\nSo I, as I grow stiff and cold\r\nTo this and that say Good-bye too;\r\nAnd everybody sees that I am old\r\nBut you.\n\r\nAnd one fine morning in a sunny lane\r\nSome boy and girl will meet and kiss and swear\r\nThat nobody can love their way again\r\nWhile over there\r\nYou will have smiled, I shall have tossed your hair.\n\nTo Celia\r\nby Ben Jonson\n\r\nDrink to me, only, with thine eyes,\r\nAnd I will pledge with mine;\r\nOr leave a kiss but in the cup,\r\nAnd I'll not look for wine.\r\nThe thirst that from the soul doth rise,\r\nDoth ask a drink divine:\r\nBut might I of Jove's nectar sup,\r\nI would not change for thine.\n\r\n    I sent thee, late, a rosy wreath,\r\n    Not so much honouring thee,\r\n    As giving it a hope, that there\r\n    It could not withered be.\r\n    But thou thereon didst only breathe,\r\n    And sent'st back to me:\r\n    Since when it grows, and smells, I swear,\r\n    Not of itself, but thee.\n\r\nBen Jonson \n\nWulf and Eadwacer (Anonymous Ballad, circa 960-990 AD)\r\nloose translation by Michael R. Burch\n\r\nThe outlanders pursue him as if he were game.\r\nThey will kill him if he comes in force.\r\nIt is otherwise with us.\n\r\nWulf is on one island; I, on another.\r\nThat island is fast, surrounded by fens.\r\nThere are fierce men on this island.\r\nThey will kill him if he comes in force.\r\nIt is otherwise with us.\n\r\nMy thoughts pursued Wulf like a panting hound.\r\nWhenever it rained and I woke disconsolate\r\nthe bold warrior came: he took me in his arms.\r\nFor me, there was pleasure, but its end was loathsome. \r\nWulf, O, my Wulf, my ache for you\r\nhas made me sick; your infrequent visits\r\nhave left me famished, but why should I eat?\r\nDo you hear, Eadwacer? A she-wolf has borne\r\nour wretched whelp to the woods.\r\nOne can easily sunder what was never one:\r\nour song together.\n\r\n\"Wulf and Eadwacer\" has been one of my favorite poems since the first time I read it. In fact, I liked the poem so much that I ended \r\nup translating it myself! This is one of the oldest poems in the English language, and in all likelihood the first extant poem by an English \r\nfemale poet. It is also one of the first English poems to employ a refrain, and the closing metaphor of a loveless relationship being like a \r\nsong in which two voices never harmonized remains one of the strongest in all literature.\n\nDistant light\r\nby Walid Khazindar\n\r\nHarsh and cold\r\nautumn holds to it our naked trees:\r\nIf only you would free, at least, the sparrows\r\nfrom the tips of your fingers\r\nand release a smile, a small smile\r\nfrom the imprisoned cry I see.\r\nSing! Can we sing\r\nas if we were light, hand in hand\r\nsheltered in shade, under a strong sun?\r\nWill you remain, this way\r\nstoking the fire, more beautiful than necessary, and \r\nquiet?\r\nDarkness intensifies\r\nand the distant light is our only consolation —\r\nthat one, which from the beginning\r\nhas, little by little, been flickering\r\nand is now about to go out.\r\nCome to me. Closer and closer.\r\nI don't want to know my hand from yours.\r\nAnd let's beware of sleep, lest the snow smother us.\n\r\nTranslated by Khaled Mattawa from the author's collections Ghuruf Ta'isha (Dar al-Fikr, Beirut, 1992) and Satwat al-Masa \r\n(Dar Bissan, Beirut, 1996). Reprinted from Banipal No 6. Translation copyright Banipal and translator. All rights reserved. \r\nWalid Khazindar was born in 1950 in Gaza City. He is considered one of the best Palestinian poets; his poetry has been said to be \r\n\"characterized by metaphoric originality and a novel thematic approach unprecedented in Arabic poetry.\" He was awarded the first \r\nPalestine Prize for Poetry in 1997.\n\nJuan's Song\r\nby Louise Bogan\n\r\nWhen beauty breaks and falls asunder\r\nI feel no grief for it, but wonder.\r\nWhen love, like a frail shell, lies broken,\r\nI keep no chip of it for token.\r\nI never had a man for friend\r\nWho did not know that love must end.\r\nI never had a girl for lover\r\nWho could discern when love was over.\r\nWhat the wise doubt, the fool believes\r\nWho is it, then, that love deceives?\r\nDylan Thomas's elegy to his dying father is the best villanelle in the English \r\nlanguage, in my opinion, and one of the most powerful and haunting poems ever \r\nwritten in any language. \n\nDo Not Go Gentle Into That Good Night\r\nby Dylan Thomas\n\r\nDo not go gentle into that good night,\r\nOld age should burn and rave at close of day;\r\nRage, rage against the dying of the light.\n\r\nThough wise men at their end know dark is right,\r\nBecause their words had forked no lightning they\r\nDo not go gentle into that good night.\n\r\nGood men, the last wave by, crying how bright\r\nTheir frail deeds might have danced in a green bay,\r\nRage, rage against the dying of the light.\n\r\nWild men who caught and sang the sun in flight,\r\nAnd learn, too late, they grieved it on its way,\r\nDo not go gentle into that good night.\n\r\nGrave men, near death, who see with blinding sight\r\nBlind eyes could blaze like meteors and be gay, \r\nRage, rage against the dying of the light.\n\r\nAnd you, my father, there on the sad height,\r\nCurse, bless, me now with your fierce tears, I pray.\r\nDo not go gentle into that good night.\r\nRage, rage against the dying of the light.\n\nDover Beach\r\nby Matthew Arnold\n\r\nThe sea is calm to-night,\r\nThe tide is full, the moon lies fair\r\nUpon the straits; on the French coast the light\r\nGleams and is gone; the cliffs of England stand,\r\nGlimmering and vast, out in the tranquil bay.\r\nCome to the window, sweet is the night-air!\r\nOnly, from the long line of spray\r\nWhere the sea meets the moon-blanched land,\r\nListen! you hear the grating roar\r\nOf pebbles which the waves draw back, and fling,\r\nAt their return, up the high strand,\r\nBegin, and cease, and then again begin,\r\nWith tremulous cadence slow, and bring\r\nThe eternal note of sadness in.\n\r\nSophocles long ago\r\nHeard it on the Aegean, and it brought\r\nInto his mind the turbid ebb and flow\r\nOf human misery; we\r\nFind also in the sound a thought,\r\nHearing it by this distant northern sea.\n\r\nThe sea of faith\r\nWas once, too, at the full, and round earth's shore\r\nLay like the folds of a bright girdle furled.\r\nBut now I only hear\r\nIts melancholy, long, withdrawing roar,\r\nRetreating, to the breath\r\nOf the night-wind, down the vast edges drear\r\nAnd naked shingles of the world.\n\r\nAh, love, let us be true\r\nTo one another! for the world which seems\r\nTo lie before us like a land of dreams,\r\nSo various, so beautiful, so new,\r\nHath really neither joy, nor love, nor light,\r\nNor certitude, nor peace, nor help for pain;\r\nAnd we are here as on a darkling plain\r\nSwept with confused alarms of struggle and flight,\r\nWhere ignorant armies clash by night.\n\r\n\"Dover Beach\" may be the first modern English poem. When Arnold speaks of the \"Sea of Faith\" retreating, he seems to be setting \r\nthe stage for Modernism, which to some degree was a movement of skeptics who \r\ndoubted that the \"wisdom\" contained \r\nin the Bible was the revelation of an all-knowing God.\n\n\r\nSong\nby Christina Rossetti\n\r\nWhen I am dead, my dearest,\r\n  Sing no sad songs for me;\r\nPlant thou no roses at my head,\r\n  Nor shady cypress tree:\r\nBe the green grass above me\r\n  With showers and dewdrops wet;\r\nAnd if thou wilt, remember,\r\n  And if thou wilt, forget.\n\r\nI shall not see the shadows,\r\n  I shall not feel the rain;\r\nI shall not hear the nightingale\r\n  Sing on, as if in pain:\r\nAnd dreaming through the twilight\r\n  That doth not rise nor set,\r\nHaply I may remember,\r\n  And haply may forget.\n\r\nChristina Rossetti wrote a handful of immortal poems, and that makes her an \r\nimmortal poet. \r\nTwo of her poems can be found on the \r\nMasters \r\npage of The HyperTexts.\n\n\n\r\nFor Her Surgery\r\nby Jack Butler\n\r\nI\r\nOver the city the moon rides in mist,\r\nscrim scarred with faint rainbow.\r\nTwo days till Easter. The thin clouds run slow, slow,\r\nthe wind bells bleed the quietest\r\nof possible musics to the dark lawn.\r\nAll possibility we will have children is gone.\n\r\nII\r\nI raise a glass half water, half alcohol,\r\nto that light come full again.\r\nInside, you sleep, somewhere below the pain.\r\nDown at the river, there is a tall\r\nghost tossing flowers to dark water—\r\njessamine, rose, and daisy, salvia lyrata . . .\n\r\nIII\r\nOh goodbye, goodbye to bloom in the white blaze\r\nof moon on the river, goodbye\r\nto creek joining the creek joining the river, the axil, the Y,\r\ngoodbye to the Yes of two Ifs in one phrase . . .\r\nChildren bear children. We are grown,\r\nand time has thrown us free under the timeless moon.\n\nJack Butler is one of my favorite contemporary poets.\n\n\r\nOne Art\nby Elizabeth Bishop\n\r\nThe art of losing isn't hard to master;\r\nso many things seem filled with the intent\r\nto be lost that their loss is no disaster.\n\r\nLose something every day. Accept the fluster\r\nof lost door keys, the hour badly spent.\r\nThe art of losing isn't hard to master.\n\r\nThen practice losing farther, losing faster:\r\nplaces, and names, and where it was you meant \r\nto travel. None of these will bring disaster.\n\r\nI lost my mother's watch. And look! my last, or\r\nnext-to-last, of three loved houses went.\r\nThe art of losing isn't hard to master.\n\r\nI lost two cities, lovely ones. And, vaster,\r\nsome realms I owned, two rivers, a continent.\r\nI miss them, but it wasn't a disaster.\n\r\n—Even losing you (the joking voice, a gesture\r\nI love) I shan't have lied. It's evident\r\nthe art of losing's not too hard to master\r\nthough it may look like (Write it!) like disaster.\n\r\nElizabeth Bishop wrote a small handful of truly great poems such as \"One Art,\" \r\n\"The Fish\" and \"The Armadillo,\" and can probably be considered a major poet as a \r\nresult.\n\nSometimes Mysteriously\n\r\nby Luis Omar Salinas\n\r\nSometimes in the evening when love\r\ntunes its harp and the crickets\r\ncelebrate life, I am like a troubadour\r\nin search of friends, loved ones,\r\nanyone who will share with me\r\na bit of conversation. My loneliness\r\narrives ghostlike and pretentious,\r\nit seeks my soul, it is ravenous\r\nand hurting. I admire my father\r\nwho always has advice in these matters,\r\nbut a game of chess won't do, or\r\nthe frivolity of religion.\r\nI want to find a solution, so I\r\nwrite letters, poems, and sometimes\r\nI touch solitude on the shoulder\r\nand surrender to a great tranquility.\r\nI understand I need courage\r\nand sometimes, mysteriously,\r\nI feel whole.\n\r\nLuis Omar Salinas is generally considered to be one of the very best Hispanic \r\npoets to write in English, with good cause. \"Sometimes Mysteriously\" is one of \r\nthose mysterious poems that sometimes makes us feel a special kinship with the \r\npoet.\n\nThe Maiden’s Song \nMedieval Lyric, Poet Unknown\n\n\nThe maidens came when I was in my mother’s bower.\r\nI had all that I would.\n\r\n    The bailey beareth the bell away;\r\n     The lily, the rose, the rose I lay.\n\r\nThe silver is white, red is the gold;\r\nThe robes they lay in fold.\n\r\n    The bailey beareth the bell away;\r\n    The lily, the rose, the rose I lay.\n\r\nAnd through the glass window shines the sun.\r\nHow should I love, and I so young?\n\r\n    The bailey beareth the bell away;\r\n    The lily, the rose, the rose I lay.\n\nTime in Eternity\r\nby T. Merrill\n\r\nWhen you were as an angel in my arms,\r\nHad laid your bare head just below my chin,\r\nYour length pressed up to mine, entrusting charms\r\nMy whole youth's starward longing could not win;\r\nWith still the murmur of your love in me,\r\nMiracle-tones of all my lifelong hope,\r\nI wished that there might start eternity\r\nAnd seal forever that sweet envelope;\r\nAnd as it did, my thoughts are now for you\r\nAs every star is blotted by the sun,\r\nAnd so the sun itself\r\nHas perished too,\r\nAnd with it, every dream of mine\r\nBut one.\n\r\nTom Merrill is one of my favorite contemporary poets.\n\nIn My Craft Or Sullen Art\r\nby Dylan Thomas\n\r\nIn my craft or sullen art\r\nExercised in the still night\r\nWhen only the moon rages\r\nAnd the lovers lie abed\r\nWith all their griefs in their arms,\r\nI labour by singing light\r\nNot for ambition or bread\r\nOr the strut and trade of charms\r\nOn the ivory stages\r\nBut for the common wages\r\nOf their most secret heart.\r\nNot for the proud man apart\r\nFrom the raging moon I write\r\nOn these spindrift pages\r\nNor for the towering dead\r\nWith their nightingales and psalms\r\nBut for the lovers, their arms\r\nRound the griefs of the ages,\r\nWho pay no praise or wages\r\nNor heed my craft or art.\n\r\nIn poems like \"Do Not Go Gentle into that Good Night,\" \"In My Craft or Sullen Art\" and \"Fern Hill\" the Welsh poet \r\nDylan Thomas ranks with any poet who ever wrote in English. Several of his poems can be found on the Masters \r\npage of The HyperTexts.\n\n\nSonnet 147\n\nby William Shakespeare\n\r\nMy love is as a fever, longing still\r\nFor that which longer nurseth the disease,\r\nFeeding on that which doth preserve the ill,\r\nThe uncertain sickly appetite to please.\r\nMy reason, the physician to my love,\r\nAngry that his prescriptions are not kept,\r\nHath left me, and I desperate now approve\r\nDesire is death, which physic did except.\r\nPast cure I am, now reason is past care,\r\nAnd frantic-mad with evermore unrest.\r\nMy thoughts and my discourse as madmen's are,\r\nAt random from the truth vainly expressed,\r\n       For I have sworn thee fair, and thought thee bright,\r\n       Who art as black as Hell, as dark as night.\n\nCome slowly, Eden\r\nby Emily Dickinson\n\r\nCome slowly, Eden\r\nLips unused to thee.\r\nBashful, sip thy jasmines,\r\nAs the fainting bee,\r\nReaching late his flower,\r\nRound her chamber hums,\r\nCounts his nectars—alights,\r\nAnd is lost in balms!\n\nit may not always be so; and i say\r\nby e.e. cummings\n\r\nit may not always be so;and i say\r\nthat if your lips,which i have loved,should touch\r\nanother's,and your dear strong fingers clutch\r\nhis heart,as mine in time not far away;\r\nif on another's face your sweet hair lay\r\nin such a silence as i know,or such\r\ngreat writhing words as,uttering overmuch,\r\nstand helplessly before the spirit at bay;\n\r\nif this should be,i say if this should be—\r\nyou of my heart,send me a little word;\r\nthat i may go unto him,and take his hands,\r\nsaying,Accept all happiness from me.\r\nThen shall i turn my face,and hear one bird\r\nsing terribly afar in the lost lands.\n\nWild Nights\r\nby Emily Dickinson\n\r\nWild nights! Wild nights! \r\nWere I with thee, \r\nWild nights should be \r\nOur luxury! \n\r\nFutile the winds \r\nTo a heart in port,— \r\nDone with the compass, \r\nDone with the chart. \n\r\nRowing in Eden! \r\nAh! the sea! \r\nMight I but moor \r\nTo-night in thee!\n\nShe Walks In Beauty\nby Lord Bryon\n\r\nShe walks in beauty, like the night\r\nOf cloudless climes and starry skies;\r\nAnd all that's best of dark and bright\r\nMeet in her aspect and her eyes:\r\nThus mellow'd to that tender light\r\nWhich heaven to gaudy day denies.\n\r\nOne shade the more, one ray the less,\r\nHad half impair'd the nameless grace\r\nWhich waves in every raven tress,\r\nOr softly lightens o'er her face;\r\nWhere thoughts serenely sweet express\r\nHow pure, how dear their dwelling-place.\n\r\nAnd on that cheek, and o'er that brow,\r\nSo soft, so calm, yet eloquent,\r\nThe smiles that win, the tints that glow,\r\nBut tell of days in goodness spent,\r\nA mind at peace with all below,\r\nA heart whose love is innocent!\n\nMeeting at Night\nby Robert Browning\n\r\nThe grey sea and the long black land;\r\nAnd the yellow half-moon large and low;\r\nAnd the startled little waves that leap\r\nIn fiery ringlets from their sleep,\r\nAs I gain the cove with pushing prow,\r\nAnd quench its speed i' the slushy sand.\n\r\nThen a mile of warm sea-scented beach;\r\nThree fields to cross till a farm appears;\r\nA tap at the pane, the quick sharp scratch\r\nAnd blue spurt of a lighted match,\r\nAnd a voice less loud, through its joys and fears,\r\nThan the two hearts beating each to each!\nMad Girl's Love Song\r\nby Sylvia Plath \n\r\nI shut my eyes and all the world drops dead;\r\nI lift my lids and all is born again.\r\n(I think I made you up inside my head.)\n\r\nThe stars go waltzing out in blue and red,\r\nAnd arbitrary blackness gallops in:\r\nI shut my eyes and all the world drops dead.\n\r\nI dreamed that you bewitched me into bed\r\nAnd sung me moon-struck, kissed me quite insane.\r\n(I think I made you up inside my head.)\n\r\nGod topples from the sky, hell's fires fade:\r\nExit seraphim and Satan's men:\r\nI shut my eyes and all the world drops dead.\n\r\nI fancied you'd return the way you said,\r\nBut I grow old and I forget your name.\r\n(I think I made you up inside my head.)\n\r\nI should have loved a thunderbird instead;\r\nAt least when spring comes they roar back again.\r\nI shut my eyes and all the world drops dead.\r\n(I think I made you up inside my head.)\n\nShall I Compare Thee to a Summer's Day?\r\nby William Shakespeare\n\r\nShall I compare thee to a summer's day?\r\nThou art more lovely and more temperate.\r\nRough winds do shake the darling buds of May,\r\nAnd summer's lease hath all too short a date.\r\nSometime too hot the eye of heaven shines,\r\nAnd often is his gold complexion dimmed;\r\nAnd every fair from fair sometime declines,\r\nBy chance, or nature's changing course untrimmed.\r\nBut thy eternal summer shall not fade\r\nNor lose possession of that fair thou ow'st;\r\nNor shall death brag thou wand'rest in his shade,\r\nWhen in eternal lines to time thou grow'st,\r\nSo long as men can breathe or eyes can see,\r\nSo long lives this, and this gives life to thee.\n\nWho ever loved\r\nby Christopher Marlowe\n\r\nIt lies not in our power to love or hate,\r\nFor will in us is overruled by fate.\r\nWhen two are stripped, long ere the course begin,\r\nWe wish that one should love, the other win;\n\r\nAnd one especially do we affect\r\nOf two gold ingots, like in each respect:\r\nThe reason no man knows; let it suffice\r\nWhat we behold is censured by our eyes.\r\nWhere both deliberate, the love is slight:\r\nWho ever loved, that loved not at first sight?\n\nBright Star\nby John Keats\n\r\nBright star, would I were steadfast as thou art\r\nNot in lone splendour hung aloft the night,\r\nAnd watching, with eternal lids apart,\r\nLike nature's patient sleepless eremite,\r\nThe moving waters at their priestlike task\r\nOf pure ablution round earth's human shores,\r\nOr gazing on the new soft-fallen mask\r\nOf snow upon the mountains and the moors;\r\nNo yet still steadfast, still unchangeable,\r\nPillow'd upon my fair love's ripening breast,\r\nTo feel for ever its soft fall and swell,\r\nAwake for ever in a sweet unrest,\r\nStill, still to hear her tender-taken breath,\r\nAnd so live ever or else swoon to death.\n\nHeart, we will forget him\r\nby Emily Dickinson\nHeart, we will forget him,\r\nYou and I, tonight!\r\nYou must forget the warmth he gave,\r\nI will forget the light.\n\r\nWhen you have done pray tell me,\r\nThen I, my thoughts, will dim.\r\nHaste! 'lest while you’re lagging\r\nI may remember him!\n\nSong\r\nby John Donne\n\r\nGo and catch a falling star,\r\nGet with child a mandrake root,\r\nTell me where all past years are,\r\nOr who cleft the devils foot;\r\nTeach me to hear mermaids singing,\r\nOr to keep off envy's stinging,\r\nAnd find\r\nWhat wind\r\nServes to advance an honest mind.\n\r\nIf thou be'st born to strange sights,\r\nThings invisible to see,\r\nRide ten thousand days and nights\r\nTill Age snow white hairs on thee;\r\nThou, when thou return'st wilt tell me\r\nAll strange wonders that befell thee,\r\nAnd swear\r\nNo where\r\nLives a woman true and fair.\n\r\nIf thou find'st one let me know;\r\nSuch a pilgrimage were sweet.\r\nYet do not; I would not go,\r\nThough at next door we might meet.\r\nThough she were true when you met her,\r\nAnd last, till you write your letter,\r\nYet she\r\nWill be\r\nFalse, ere I come, to two or three.\n\r\nJohn Donne wrote some of the sexiest poems in the English language, and some of \r\nthe best devotional poems as well. Talk about range!\n\nOne of their Gods \nby Constantine P. Cavafy\n\r\nWhen one of them moved through the centre of Selefkia\r\njust as it was getting dark―\r\nmoved like a young man, tall, extremely handsome,\r\nthe joy of being immortal in his eyes,\r\nhis hair black and perfumed―\r\nthe people going by would gaze at him,\r\nand one would ask the other if he knew him,\r\nif he was a Greek from Syria, or a stranger.\r\nBut some who looked more carefully\r\nwould understand and step aside;\r\nand as he disappeared under the arcades,\r\namong the shadows and the evening lights,\r\ngoing toward the quarter that lives\r\nonly at night, with orgies and debauchery,\r\nwith every kind of intoxication and desire,\r\nthey would wonder which of Them it could be,\r\nand for what suspicious pleasure\r\nhe'd come down into the streets of Selefkia\r\nfrom the August Celestial Mansions.\n\nLove Letter\r\nby Sylvia Plath\n\r\nNot easy to state the change you made.\r\nIf I'm alive now, then I was dead,\r\nThough, like a stone, unbothered by it,\r\nStaying put according to habit.\r\nYou didn't just tow me an inch, no\r\nNor leave me to set my small bald eye\r\nSkyward again, without hope, of course,\r\nOf apprehending blueness, or stars.\n\r\nThat wasn't it. I slept, say: a snake\r\nMasked among black rocks as a black rock\r\nIn the white hiatus of winter\r\nLike my neighbors, taking no pleasure\r\nIn the million perfectly-chisled\r\nCheeks alighting each moment to melt\r\nMy cheeks of basalt. They turned to tears,\r\nAngels weeping over dull natures,\r\nBut didn't convince me. Those tears froze.\r\nEach dead head had a visor of ice.\n\r\nAnd I slept on like a bent finger.\r\nThe first thing I was was sheer air\r\nAnd the locked drops rising in dew\r\nLimpid as spirits. Many stones lay\r\nDense and expressionless round about.\r\nI didn't know what to make of it.\r\nI shone, mice-scaled, and unfolded\r\nTo pour myself out like a fluid\r\nAmong bird feet and the stems of plants.\r\nI wasn't fooled. I knew you at once.\n\r\nTree and stone glittered, without shadows.\r\nMy finger-length grew lucent as glass.\r\nI started to bud like a March twig:\r\nAn arm and a leg, and arm, a leg.\r\nFrom stone to cloud, so I ascended.\r\nNow I resemble a sort of god\r\nFloating through the air in my soul-shift\r\nPure as a pane of ice. It's a gift.\n\n\n\r\nOther Love Poems of Note:\n\n\nThe Love Song of Shu-Sin: The Earth's Oldest Love Poem?\nFarewell, Love\r\n\nby Thomas Wyatt\nTo Daffodils\nby Robert Herrick\nTo the Virgins, to Make Much of Time\nby Robert Herrick\nThe Highwayman\n\nby Alfred Noyes\nThe Silken Tent\r\nby Robert Frost\nAfter the Persian\r\nby Louise Bogan\nLeda and the Swan by William Butler Yeats\r\nMariana by Lord Alfred Tennyson\nThe Love Song of J. Alfred Prufrock by T. S. Eliot\nFor Una\r\n\nby Robinson Jeffers\nmay i feel said he \nby e.e. cummings\n\r\n  The Skeleton's Defense of Carnality\r\n\nby Jack Foley\nA charm invests a face\r\n\nby Emily Dickinson\nI gave myself to him\r\n\nby Emily Dickinson\nWild nights\r\n\r\nby Emily Dickinson\nit is at moments after i have dreamed\r\n\nby e.e. cummings\nsomewhere i have never travelled, gladly beyond\nby e.e. cummings\nI Knew A Woman \nby Theodore Roethke\nLuke Havergal \nby Edward Arlington Robinson\nWord Made Flesh \nby Ann Drysdale\n\nSo there you have them ... the best love poems of all time, according to me. \r\nEveryone's list will be different, but if one or two of mine is now on yours, \r\nhopefully your time here was well spent.\n\r\nRelated pages:\r\nThe Best Sonnets,\r\nThe Best Villanelles,\r\nThe Best Ballads,\r\nThe Best Sestinas,\r\nThe Best Rondels and Roundels,\r\nThe Best Kyrielles,\r\nThe Best Couplets,\r\nThe Best Quatrains,\r\nThe Best Haiku,\r\n\r\nThe Best Limericks,\r\nThe Best Nonsense Verse,\r\nThe Best Poems for Kids,\r\nThe Best Light Verse,\r\n\r\nThe Best Poem of All Time,\r\nThe Best Poems Ever Written, \r\nThe Best Poets,\r\nThe Best of the Masters,\r\nThe Most Popular Poems of All Time,\r\nThe Best American Poetry,\r\nThe Best Poetry Translations,\r\nThe Best Ancient Greek Epigrams and Epitaphs,\r\nThe Best Anglo-Saxon Riddles and Kennings,\r\nThe Best Old English Poetry, \r\n\r\nThe Best Lyric Poetry,\r\nThe Best Free Verse, \r\nThe Best Story Poems,\r\nThe Best Narrative Poems,\r\nThe Best Epic Poems,\r\nThe Best Epigrams,\r\n\r\nThe Most Beautiful Poems in the English Language,\r\nThe Most Beautiful Lines in the English Language,\r\nThe Most Beautiful Sonnets in the English Language,\r\n\r\nThe Best Elegies, Dirges & Laments,\r\nThe Best Poems about Death and Loss,\r\nThe Best Holocaust Poetry,\r\nThe Best Hiroshima Poetry,\r\nThe Best Anti-War Poetry,\r\n\r\nThe Best Religious Poetry,\r\nThe Best Spiritual Poetry, \r\nThe Best Heretical Poetry, \r\n\r\nThe Best Thanksgiving Poems,\r\nThe Best Autumnal Poems,\r\nThe Best Fall/Autumn Poetry, \r\n\r\nThe Best Dark Poetry,\r\nThe Best Halloween Poetry,\r\nThe Best Supernatural Poetry,\r\nThe Best Dark Christmas Poems,\r\nThe Best Vampire Poetry,\r\n\r\nThe Best Love Poems,\r\nThe Best Urdu Love Poetry, \r\nThe Best Erotic Poems,\r\nThe Best Romantic Poetry,\r\nThe Best Love Songs,\r\n\r\nThe Ten Greatest Poems Ever Written,\r\nThe Greatest Movies of All Time,\r\nEngland's Greatest Artists,\r\n\r\nVisions of Beauty,\r\n\r\nWhat is Poetry?,\r\nThe Best Abstract Poetry,\r\nThe Best Antinatalist Poems and Prose,\r\nEarly Poems: The Best Juvenilia,\r\nHuman Perfection: Is It Possible?\n\nThe HyperTexts\n\n\r\nvar gaJsHost = ((\"https:\" == document.location.protocol) ? \"https://ssl.\" : \"http://www.\");\r\ndocument.write(unescape(\"%3Cscript src='\" + gaJsHost + \"google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E\"));\r\n\n\r\ntry {\r\nvar pageTracker = _gat._getTracker(\"UA-11422703-1\");\r\npageTracker._trackPageview();\r\n} catch(err) {}\n"}, "2": {"title": "O Mistress Mine", "author": "William Shakespeare", "poem": "O Mistress MineO Mistress mine, where are you roaming?\nO, stay and hear; your true love's coming,\nThat can sing both high and low:\nTrip no further, pretty sweeting;\nJourneys end in lovers meeting,\nEvery wise man's son doth know.\nWhat is love? 'Tis not hereafter;\nPresent mirth hath present laughter;\nWhat's to come is still unsure:\nIn delay there lies not plenty;\nThen, come kiss me, sweet and twenty,\nYouth's a stuff will not endure."}, "3": {"title": "Take, O Take", "author": "William Shakespeare", "poem": "\nTake, O TakeTAKE, O take those lips away  \nThat so sweetly were forsworn,  \nAnd those eyes, the break of day,  \nLights that do mislead the morn:  \nBut my kisses bring again,         \n      Bring again—  \nSeals of love, but seal’d in vain,  \n      Seal’d in vain!"}, "4": {"title": "Love Sonnet 1", "author": "William Shakespeare", "poem": "\nLove Sonnet 1From fairest creatures we desire increase,\nThat thereby beauty's rose might never die,\nBut as the riper should by time decease,\nHis tender heir might bear his memory:\nBut thou contracted to thine own bright eyes,\nFeed'st thy light's flame with self-substantial fuel,\nMaking a famine where abundance lies,\nThy self thy foe, to thy sweet self too cruel:\nThou that art now the world's fresh ornament,\nAnd only herald to the gaudy spring,\nWithin thine own bud buriest thy content,\nAnd, tender churl, mak'st waste in niggarding:\nPity the world, or else this glutton be,\nTo eat the world's due, by the grave and thee."}, "5": {"title": "Love Sonnet 2", "author": "William Shakespeare", "poem": "\nLove Sonnet 2When forty winters shall besiege thy brow   \nAnd dig deep trenches in thy beauty’s field,   \nThy youth’s proud livery, so gaz’d on now,   \nWill be a tatter’d weed, of small worth held:   \nThen being ask’d, where all thy beauty lies,          \nWhere all the treasure of thy lusty days,   \nTo say, within thine own deep-sunken eyes,   \nWere an all-eating shame and thriftless praise.   \nHow much more praise deserv’d thy beauty’s use,   \nIf thou couldst answer ‘This fair child of mine   \nShall sum my count, and make my old excuse,’   \nProving his beauty by succession thine!   \n  This were to be new made when thou art old,   \n  And see thy blood warm when thou feel’st it cold."}, "6": {"title": "Love Sonnet 18", "author": "William Shakespeare", "poem": "\nLove Sonnet 18Shall I compare thee to a summer's day?\nThou art more lovely and more temperate:\nRough winds do shake the darling buds of May,\nAnd summer's lease hath all too short a date:\nSometime too hot the eye of heaven shines,\nAnd often is his gold complexion dimm'd;\nAnd every fair from fair sometime declines,\nBy chance or nature's changing course untrimm'd;\nBut thy eternal summer shall not fade\nNor lose possession of that fair thou owest;\nNor shall Death brag thou wander'st in his shade,\nWhen in eternal lines to time thou growest:\nSo long as men can breathe or eyes can see,\nSo long lives this and this gives life to thee."}, "7": {"title": "Love Sonnet 29", "author": "William Shakespeare", "poem": "\nLove Sonnet 29When, in disgrace with fortune and men's eyes,\nI all alone beweep my outcast state\nAnd trouble deaf heaven with my bootless cries\nAnd look upon myself and curse my fate,\nWishing me like to one more rich in hope,\nFeatur'd like him, like him with friends possess'd,\nDesiring this man's art and that man's scope,\nWith what I most enjoy contented least;\nYet in these thoughts myself almost despising,\nHaply I think on thee, and then my state,\nLike to the lark at break of day arising\nFrom sullen earth, sings hymns at heaven's gate;\nFor thy sweet love remember'd such wealth brings\nThat then I scorn to change my state with kings."}, "8": {"title": "Love Sonnet 40", "author": "William Shakespeare", "poem": "\nLove Sonnet 40Take all my loves, my love, yea, take them all; \nWhat hast thou then more than thou hadst before? \nNo love, my love, that thou mayst true love call; \nAll mine was thine before thou hadst this more. \nThen if for my love thou my love receivest, \nI cannot blame thee for my love thou usest; \nBut yet be blamed, if thou thyself deceivest \nBy wilful taste of what thyself refusest. \nI do forgive thy robbery, gentle thief, \nAlthough thou steal thee all my poverty; \nAnd yet, love knows, it is a greater grief \nTo bear love's wrong than hate's known injury. \nLascivious grace, in whom all ill well shows, \nKill me with spites; yet we must not be foes."}, "9": {"title": "Love Sonnet 44", "author": "William Shakespeare", "poem": "\nLove Sonnet 44If the dull substance of my flesh were thought,\nInjurious distance should not stop my way.\nFor then, despite of space, I would be brought\nFrom limits far remote where thou dost stay.\nNo matter then although my foot did stand\nUpon the farthest earth removed from thee.\nFor nimble thought can jump both sea and land\nAs soon as think the place where he would be.\nBut, ah, thought kills me, that I am not thought,\nTo leap large length of miles when thou art gone,\nBut that, so much of earth and water wrought,\nI must attend times leisure with my moan,\nReceiving naught by elements so slow\nBut heavy tears, badges of either's woe."}, "10": {"title": "Love Sonnet 55", "author": "William Shakespeare", "poem": "\nLove Sonnet 55Not marble, nor the gilded monuments \n   Of princes, shall outlive this powerful rhyme; \nBut you shall shine more bright in these contents \n   Than unswept stone, besmear'd with sluttish time. \nWhen wasteful war shall statues overturn, \n   And broils root out the work of masonry, \nNor Mars his sword nor war's quick fire shall burn \n   The living record of your memory. \n'Gainst death and all oblivious enmity \n   Shall you pace forth; your praise shall still find room, \nEven in the eyes of all posterity \n   That wear this world out to the ending doom. \nSo, till the judgment that yourself arise, \n   You live in this, and dwell in lovers' eyes."}, "11": {"title": "Love Sonnet 63", "author": "William Shakespeare", "poem": "\nLove Sonnet 63Against my love shall be as I am now,\nWith Time's injurious hand crush'd and o'erworn;\nWhen hours have drain'd his blood and fill'd his brow\nWith lines and wrinkles; when his youthful morn\nHath travelled on to age's steepy night;\nAnd all those beauties whereof now he's king\nAre vanishing, or vanished out of sight,\nStealing away the treasure of his spring; \nFor such a time do I now fortify\nAgainst confounding age's cruel knife,\nThat he shall never cut from memory\nMy sweet love's beauty, though my lover's life:\nHis beauty shall in these black lines be seen,\nAnd they shall live, and he in them still green."}, "12": {"title": "Love Sonnet 105", "author": "William Shakespeare", "poem": "\nLove Sonnet 105Let not my love be called idolatry,\nNor my beloved as an idol show,\nSince all alike my songs and praises be\nTo one, of one, still such, and ever so.\nKind is my love to-day, to-morrow kind,\nStill constant in a wondrous excellence;\nTherefore my verse to constancy confined,\nOne thing expressing, leaves out difference.\nFair, kind, and true, is all my argument,\nFair, kind, and true, varying to other words;\nAnd in this change is my invention spent,\nThree themes in one, which wondrous scope affords.\nFair, kind, and true, have often lived alone,\nWhich three till now, never kept seat in one."}, "13": {"title": "Love Sonnet 109", "author": "William Shakespeare", "poem": "\nLove Sonnet 109O, never say that I was false of heart,\nThough absence seemed my flame to qualify.\nAs easy might I from my self depart\nAs from my soul which in thy breast doth lie.\nThat is my home of love; if I have ranged,\nLike him that travels I return again,\nJust to the time, not with the time exchanged,\nSo that myself bring water for my stain.\nNever believe though in my nature reigned\nAll frailties that besiege all kinds of blood,\nThat it could so preposterously be stained\nTo leave for nothing all thy sum of good;\nFor nothing this wide universe I call\nSave thou, my rose, in it thou art my all"}, "14": {"title": "Love Sonnet 116", "author": "William Shakespeare", "poem": "\nLove Sonnet 116Let me not to the marriage of true minds \nAdmit impediments; love is not love\nWhich alters when it alteration finds,\nOr bends with the remover to remove:\nO, no, it is an ever-fixèd mark,\nThat looks on tempests and is never shaken;\nIt is the star to every wand'ring bark,\nWhose worth's unknown, although his heighth be taken.\nLove's not Time's fool, though rosy lips and cheeks\nWithin his bending sickle's compass come;\nLove alters not with his brief hours and weeks,\nBut bears it out even to the edge of doom.\nIf this be error and upon me proved,\nI never writ, nor no man ever loved."}, "15": {"title": "Love Sonnet 130", "author": "William Shakespeare", "poem": "\nLove Sonnet 130My mistress' eyes are nothing like the sun;\nCoral is far more red than her lips' red;\nIf snow be white, why then her breasts are dun;\nIf hairs be wires, black wires grow on her head.\nI have seen roses damasked, red and white,\nBut no such roses see I in her cheeks;\nAnd in some perfumes is there more delight\nThan in the breath that from my mistress reeks.\nI love to hear her speak, yet well I know\nThat music hath a far more pleasing sound;\nI grant I never saw a goddess go;\nMy mistress, when she walks, treads on the ground.\nAnd yet, by heaven, I think my love as rare\nAs any she belied with false compare."}, "16": {"title": "Love Sonnet 138", "author": "William Shakespeare", "poem": "\nLove Sonnet 138When my love swears that she is made of truth,\nI do believe her though I know she lies,\nThat she might think me some untutored youth,\nUnlearned in the world's false subtleties.\nThus vainly thinking that she thinks me young,\nAlthough she knows my days are past the best,\nSimply I credit her false-speaking tongue:\nOn both sides thus is simple truth suppressed:\nBut wherefore says she not she is unjust?\nAnd wherefore say not I that I am old?\nO! love's best habit is in seeming trust,\nAnd age in love, loves not to have years told:\nTherefore I lie with her, and she with..."}, "17": {"title": "Love Sonnet 147", "author": "William Shakespeare", "poem": "\nLove Sonnet 147My love is as a fever, longing still\nFor that which longer nurseth the disease,\nFeeding on that which doth preserve the ill,\nTh' uncertain sickly appetite to please.\nMy reason, the physician to my love,\nAngry that his prescriptions are not kept,\nHath left me, and I desperate now approve\nDesire is death, which physic did except.\nPast cure I am, now reason is past care,\nAnd frantic-mad with evermore unrest;\nMy thoughts and my discourse as mad men's are,\nAt random from the truth vainly expressed.\nFor I have sworn thee fair, and thought thee bright,\nWho art as black as hell, as dark as night."}, "18": {"title": "Love Sonnet 148", "author": "William Shakespeare", "poem": "\nLove Sonnet 148O ME! what eyes hath love put in my head,  \nWhich have no correspondence with true sight:  \nOr if they have, where is my judgment fled  \nThat censures falsely what they see aright?  \nIf that be fair whereon my false eyes dote,          \nWhat means the world to say it is not so?  \nIf it be not, then love doth well denote  \nLove’s eye is not so true as all men’s: No,  \nHow can it? O how can love’s eye be true,  \nThat is so vex’d with watching and with tears?          \nNo marvel then though I mistake my view:  \nThe sun itself sees not till heaven clears.  \nO cunning Love! with tears thou keep’st me blind,  \nLest eyes well-seeing thy foul faults should find!"}, "19": {"title": "Love Sonnet 153", "author": "William Shakespeare", "poem": "\nLove Sonnet 153Cupid laid by his brand, and fell asleep:\nA maid of Dian's this advantage found,\nAnd his love-kindling fire did quickly steep\nIn a cold valley-fountain of that ground;\nWhich borrow'd from this holy fire of Love\nA dateless lively heat, still to endure,\nAnd grew a seething bath, which yet men prove\nAgainst strange maladies a sovereign cure.\nBut at my mistress' eye Love's brand new-fired,\nThe boy for trial needs would touch my breast;\nI, sick withal, the help of bath desired,\nAnd thither hied, a sad distemper'd guest,\nBut found no cure: the bath for my help lies\nWhere Cupid got new fire--my mistress' eyes."}, "20": {"title": "Love Sonnet 154", "author": "William Shakespeare", "poem": "\nLove Sonnet 154The little Love-god lying once asleep\nLaid by his side his heart-inflaming brand,\nWhilst many nymphs that vow'd chaste life to keep\nCame tripping by; but in her maiden hand\nThe fairest votary took up that fire\nWhich many legions of true hearts had warm'd;\nAnd so the general of hot desire\nWas sleeping by a virgin hand disarm'd.\nThis brand she quenched in a cool well by,\nWhich from Love's fire took heat perpetual,\nGrowing a bath and healthful remedy\nFor men diseased; but I, my mistress' thrall,\nCame there for cure, and this by that I prove,\nLove's fire heats water, water cools not love."}, "21": {"title": "The Pity of Love", "author": "William Butler Yeats", "poem": "\nA pity beyond all telling\nIs hid in the heart of love:\nThe folk who are buying and selling;\nThe clouds on their journey above;\nThe cold wet winds ever blowing;\nAnd the shadowy hazel grove\nWhere mouse-grey waters are flowing\nThreaten the head that I love."}, "22": {"title": "The Rose of Battle", "author": "William Butler Yeats", "poem": "\nRose of all Roses, Rose of all the world!\nThe tall thought-woven sails, that flap unfurled\nAbove the tide of hours, throuble the air,\nAnd God's bell buoyed to be the water's care\nWhile hushed from fear, or loud with hope, a band\nWith blown, spray-dabbled hair gather at hand.\nTurn if you may from battles never done,\nI call, as they go by me one by one,\nDanger no refuge holds, and war no peace,\nFor him who hears love sing and never cease,\nBeside her clean-swept hearth, her quiet shade:\nBut gather all for whom no love hath made\nA woven silence, or but came to cast\nA song into the air, and singing past\nTo smile on the pale dawn; and gather you\np.2\nWho have sought more than is in rain or dew\nOr in the sun and moon, or on the earth,\nOr sighs amid the wandering, starry mirth,\nOr comes in laughter from the sea's sad lips;\nAnd wage God's battles in the long gray ships.\nThe sad, the lonely, the insatiable,\nTo these Old Night shall all her mystery tell;\nGod's bell has claimed them by the little cry\nOf their hearts, that may not live nor die.\nRose of all Roses, Rose of all the World!\nYou, too, have come where the dim tides are hurled\nUpon the wharves of sorrow, and heard ring\nThe bell that calls us on; the sweet far thing.\nBeauty grown sad with its eternity\nMade you of us, and of the dim gray sea.\nOur long ships loose thought-woven sails and wait,\nFor God has bid them share an equal fate;\nAnd when at last defeated in His wars,\nThey have gone down under the same white stars,\nWe shall no longer hear the little cry\nOf our sad hearts, that may not live nor die."}, "23": {"title": "When you are old", "author": "William Butler Yeats", "poem": "\nWhen you are old and gray and full of sleep,\nAnd nodding by the fire, take down this book,\nAnd slowly read, and dream of the soft look\nYour eyes had once and of their shadows deep;\np.3\nHow many loved your moments of glad grace,\nAnd loved your beauty with love false or true;\nBut one man loved the pilgrim soul in you,\nAnd loved the sorrows of your changing face.\nAnd bending down beside the glowing bars\nMurmus, a little sadly, how love fled\nAnd paced upon the mountains overhead\nAnd hid his face amid a crowd of stars."}, "24": {"title": "The Rose of the world", "author": "William Butler Yeats", "poem": "\nWho dreamed that beauty passes like a dream?\nFor these red lips, with all their mournful pride,\nMournful that no new wonder may betide,\nTroy passed away in one high funeral gleam,\nAnd Usna's children died.\nWe and the labouring world are passing by:\nAmid men's souls, that waver and give place\nLike the pale waters in their wintry race,\nUnder the passing stars, foam of the sky,\nLives on this lonely face.\nBow down, archangels, in your dim abode:\nBefore you were, or any hearts to beat,\nWeary and kind one lingered by His seat;\nHe made the world to be a grassy road\nBefore her wandering feet."}, "25": {"title": "The Lover tells of the Rose in his Heart", "author": "William Butler Yeats", "poem": "\nAll things uncomely and broken, all things worn and old,\nThe cry of a child by the roadway, the creak of a lumbering cart,\nThe heavy steps of the ploughman, splashing the wintry mould,\nAre wronging your image that blossoms a rose in the deeps of my heart.\nThe wrong of unshapely things is a wrong too great to be told;\nI hunger to build them anew and sit on a green knoll apart,\nWith the earth and the sky and the water, remade, like a casket of gold\nFor my dreams of your image that blossoms a rose in the deeps of my heart."}, "26": {"title": "The Lover mourns for the loss of Love", "author": "William Butler Yeats", "poem": "\nPale brows, still hands and dim hair,\nI had a beautiful friend\nAnd dreamed that the old despair\nWould end in love in the end:\nShe looked in my heart one day\nAnd saw your image was there;\nShe has gone weeping away."}, "27": {"title": "He mourns for the change that has come upon him and his beloved and longs for the end of the world", "author": "William Butler Yeats", "poem": "\nDo you not hear me calling, white deer with no horns!\nI have been changed to a hound with one red ear;\nI have been in the Path of Stones and the Wood of Thorns,\nFor somebody hid hatred and hope and desire and fear\nUnder my feet that they follow you night and day.\nA man with a hazel wand came without sound;\nHe changed me suddenly; I was looking another way;\nAnd now my calling is but the calling of a hound;\nAnd Time and Birth and Change are hurrying by.\nI would that the Boar without bristles had come from the West\nAnd had rooted the sun and moon and stars out of the sky\nAnd lay in the darkness, grunting, and turning to his rest."}, "28": {"title": "He tells of a valley full of lovers", "author": "William Butler Yeats", "poem": "\nI dreamed that I stood in a valley, and amid sighs,\nFor happy lovers passed two by two where I stood;\nAnd I dreamed my lost love came stealthily out of the wood\nWith her cloud-pale eyelids falling on dream-dimmed eyes:\nI cried in my dream, O women, bid the young men lay\nTheir heads on your knees, and drown their eyes with your hair,\nOr remembering hers they will find no other face fair\nTill all the valleys of the world have been withered away."}, "29": {"title": "He remembers forgotten Beauty", "author": "William Butler Yeats", "poem": "\nWhen my arms wrap you round I press\nMy heart upon the loveliness\nThat has long faded from the world;\nThe jewelled crowns that kings have hurled\nIn shadowy pools, when armies fled;\nThe love-tales wrought with silken thread\nBy dreaming ladies upon cloth\nThat has made fat the murderous moth;\nThe roses that of old time were\nWoven by ladies in their hair.\nThe dew-cold lilies ladies bore\nThrough many a sacred corridor\nWhere such gray clouds of incense rose\nThat only the gods' eyes did not close:\nFor that pale breast and lingering hand\nCome from a more dream-heavy land,\nA more dream-heavy hour than this;\nAnd when you sigh from kiss to kiss\nI hear white Beauty sighing, too,\nFor hours when all must fade like dew,\nAll but the flames, and deep on deep.\nThrone over throne where in half sleep.\nTheir swords upon their iron knees,\nBrood her high lonely mysteries."}, "30": {"title": "He bids his beloved be at peace", "author": "William Butler Yeats", "poem": "\nI hear the Shadowy Horses, their long manes a-shake,\nTheir hoofs heavy with tumult, their eyes glimmering white;\nThe North unfolds above them clinging, creeping night,\nThe East her hidden joy before the morning break,\nThe West weeps in pale dew and sighs passing away,\nThe South is pouring down roses of crimson fire:\nO vanity of Sleep, Hope, Dream, endless Desire,\nThe Horses of Disaster plunge in the heavy clay:\nBeloved, let your eyes half close, and your heart beat\nOver my heart, and your hair fall over my breast,\nDrowning love's lonely hour in deep twilight of rest,\nAnd hiding their tossing manes and their tumultuous feet."}, "31": {"title": "He gives his beloved certain rhymes", "author": "William Butler Yeats", "poem": "\nFasten your hair with a golden pin,\nAnd bind up every wandering tress;\nI bade my heart build these poor rhymes:\nIt worked at them, day out, day in,\nBuilding a sorrowful loveliness\nOut of the battles of old times.\nYou need but lift a pearl-pale hand,\nAnd bind up your long hair and sigh;\nAnd all men's hearts must burn and beat;\nAnd candle-like foam on the dim sand,\nAnd stars climbing the dew-dropping sky,\nLive but to light your passing feet."}, "32": {"title": "He tells of the perfect Beauty", "author": "William Butler Yeats", "poem": "\nO cloud-pale eyelids, dream-dimmed eyes,\nThe poets labouring all their days\nTo build a perfect beauty in rhyme\nAre overthrown by a woman's gaze\nAnd by the unlabouring brood of the skies:\nAnd therefore my heart will bow, when dew\nIs dropping sleep, until God burn time,\nBefore the unlabouring stars and you."}, "33": {"title": "He reproves the curlew", "author": "William Butler Yeats", "poem": "\nO, curlew, cry no more in the air,\nOr only to the waters in the West;\nBecause your crying brings to my mind\nPassion-dimmed eyes and long heavy hair\nThat was shaken out over my breast:\nThere is enough evil in the crying of wind."}, "34": {"title": "The travail of passion", "author": "William Butler Yeats", "poem": "\nWhen the flaming lute-thronged angelic door is wide;\nWhen an immortal passion breathes in mortal clay;\nOur hearts endure the scourge, the plaited thorns, the way\nCrowded with bitter faces, the wounds in palm and side,\nThe hyssop-heavy sponge, the flowers by Kidron stream.\nWe will bend down and loosen our hair over you,\nThat it may drop faint perfume, and be heavy with dew,\nLilies of death-pale hope, roses of passionate dream."}, "35": {"title": "The lover asks forgiveness because of his many moods", "author": "William Butler Yeats", "poem": "\nIf this importunate heart trouble your peace\nWith words lighter than air,\nOr hopes that in mere hoping flicker and cease;\nCrumple the rose in your hair;\nAnd cover your lips with odorous twilight and say,\n'0 hearts of wind-blown flame!\nO Winds, elder than changing of night and day,\nThat murmuring and longing came\nFrom marble cities loud with tabors of old\nIn dove-gray faery lands;\nFrom battle banners, fold upon purple fold,\nQueens wrought with glimmering hands;\nThat saw young Niamh hover with love-lorn face\nAbove the wandering tide;\nAnd lingered in the hidden desolate place\nWhere the last Phoenix died,\nAnd wrapped the flames above his holy head;\nAnd still murmur and long:\nO Piteous Hearts, changing till change be dead\nIn a tumultuous song:'\nAnd cover the pale blossoms of your breast\nWith your dim heavy hair.\nAnd trouble with a sigh for all things longing for rest\nThe odorous twilight there."}, "36": {"title": "The lover pleads with his friend for old friends", "author": "William Butler Yeats", "poem": "\nThough you are in your shining days,\nVoices among the crowd\nAnd new friends busy with your praise,\nBe not unkind or proud,\nBut think about old friends the most:\nTime's bitter flood will rise,\nYour beauty perish and be lost\nFor all eyes but these eyes."}, "37": {"title": "He wishes his beloved were dead", "author": "William Butler Yeats", "poem": "\nWere you but lying cold and dead,\nAnd lights were paling out of the West,\nYou would come hither, and bend your head,\nAnd I would lay my head on your breast;\nAnd you would murmur tender words,\nForgiving me, because you were dead:\nNor would you rise and hasten away,\nThough you have the will of the wild birds,\nBut know your hair was bound and wound\nAbove the stars and moon and sun:\nO would, beloved, that you lay\nUnder the dock-leaves in the ground,\nWhile lights were paling one by one."}, "38": {"title": "A poet to his beloved", "author": "William Butler Yeats", "poem": "\nI bring you with reverent hands\nThe books of my numberless dreams;\nWhite woman that passion has worn\nAs the tide wears the dove-gray sands,\nAnd with heart more old than the horn\nThat is brimmed from the pale fire of time:\nWhite woman with numberless dreams\nI bring you my passionate rhyme."}, "39": {"title": "He wishes for the cloths of heaven", "author": "William Butler Yeats", "poem": "\nHad I the heavens' embroidered cloths,\nEnwrought with golden and silver light,\nThe blue and the dim and the dark cloths\nOf night and light and the half light,\nI would spread the cloths under your feet:\nBut I, being poor, have only my dreams;\nI have spread my dreams under your feet;\nTread softly because you tread on my dreams."}, "40": {"title": "Adam's curse", "author": "William Butler Yeats", "poem": "\nWe sat together at one summer's end,\nThat beautiful mild woman, your close friend,\nAnd you and I, and talked of poetry.\nI said: 'A line will take us hours maybe;\nYet if it does not seem a moment's thought,\nOur stitching and unstitching has been naught.\nBetter go down upon your marrow-bones\nAnd scrub a kitchen pavement, or break stones\nLike an old pauper, in all kinds of weather;\nFor to articulate sweet sounds together\nIs to work harder than all these, and yet\nBe thought an idler by the noisy set\nOf bankers, schoolmasters, and clergymen\nThe martyrs call the world.'\nThat woman then\nMurmured with her young voice, for whose mild sake\nThere's many a one shall find out all heartache\nIn finding that it's young and mild and low:\n'There is one thing that all we women know,\nAlthough we never heard of it at school\u0097\nThat we must labour to be beautiful.'\np.13\nI said: 'It's certain there is no fine thing\nSince Adam's fall but needs much labouring.\nThere have been lovers who thought love should be\nSo much compounded of high courtesy\nThat they would sigh and quote with learned looks\nPrecedents out of beautiful old books;\nYet now it seems an idle trade enough.'\nWe sat grown quiet at the name of love;\nWe saw the last embers of daylight die,\nAnd in the trembling blue-green of the sky\nA moon, worn as if it had been a shell\nWashed by time's waters as they rose and fell\nAbout the stars and broke in days and years.\nI had a thought for no one's but your ears;\nThat you were beautiful, and that I strove\nTo love you in the old high way of love;\nThat it had all seemed happy, and yet we'd grown\nAs weary-hearted as that hollow moon."}, "41": {"title": "The folly of being comforted", "author": "William Butler Yeats", "poem": "\nOne that is ever kind said yesterday:\n'Your well-beloved's hair has threads of grey,\nAnd little shadows come about her eyes;\nTime can but make it easier to be wise,\nThough now it's hard, till trouble is at an end;\np.14\nAnd so be patient, be wise and patient, friend.'\nBut, heart, there is no comfort, not a grain;\nTime can but make her beauty over again.\nBecause of that great nobleness of hers\nThe fire that stirs about her when she stirs\nBurns but more clearly. O she had not these ways,\nWhen all the wild summer was in her gaze.\nO heart ! O heart ! if she'd but turn her head,\nYou'd know the folly of being comforted."}, "42": {"title": "Old Memory", "author": "William Butler Yeats", "poem": "\nThought fly to her when the end of day\nAwakens an old memory, and say,\n'Your strength, that is so lofty and fierce and kind,\nIt might call up a new age, calling to mind\nThe queens that were imagined long ago,\nIs but half yours: he kneaded in the dough\nThrough the long years of youth, and who would have thought\nIt all, and more than it all, would come to naught,\nAnd that dear words meant nothing?' But enough,\nFor when we have blamed the wind we can blame love;\nOr, if there needs be more, be nothing said\nThat would be harsh for children that have strayed."}, "43": {"title": "Under the moon", "author": "William Butler Yeats", "poem": "\nI have no happiness in dreaming of Brycelinde,\nNor Avalon the grass-green hollow, nor Joyous Isle,\np.15\nWhere one found Lancelot crazed and hid him for a while;\nNor Ulad, when Naoise had thrown a sail upon the wind,\nNor lands that seem too dim to be burdens on the heart;\nLand-under-Wave, where out of the moon's light and the sun's\nSeven old sisters wind the threads of the long-lived ones;\nLand-of-the-Tower, where Aengus has thrown the gates apart,\nAnd Wood-of-Wonders, where one kills an ox at dawn,\nTo find it when night falls laid on a golden bier:\nTherein are many queens like Branwen and Guinivere;\nAnd Niamh and Laban and Fand, who could change to an otter or fawn,\nAnd the wood-woman, whose lover was changed to a blue-eyed hawk;\nAnd whether I go in my dreams by woodland, or dun, or shore,\nOr on the unpeopled waves with kings to pull at the oar,\nI hear the harp-string praise them, or hear their mournful talk.\nBecause of a story I heard under the thin horn\nOf the third moon, that hung between the night and the day,\nTo dream of women whose beauty was folded in dismay.\nEven in an old story, is a burden not to be borne."}, "44": {"title": "Baile and Aillinn", "author": "William Butler Yeats", "poem": "\nArgument. Baile and Aillinn were lovers, but Aengus,1\nthe Master of Love, wishing them to be happy\nin his own land among the dead, told to each a story\nof the other's death, so that their hearts were broken\nand they died.\np.16\nI hardly hear the curlew cry,\nNor the grey rush when wind is high,\nBefore my thoughts begin to run\nOn the heir of Ulad, Buan's son,\nBaile who had the honey mouth,\nAnd that mild woman of the south,\nAillinn, who was King Lugaid's heir.\nTheir love was never drowned in care\nOf this or that thing, nor grew cold\nBecause their bodies had grown old;\nBeing forbid to marry on earth\nThey blossomed to immortal mirth.\nAbout the time when Christ was born,\nWhen the long wars for the White Horn\nAnd the Brown Bull had not yet come,\nYoung Baile Honey-Mouth, whom some\nCalled rather Baile Little-Land,\nRode out of Emain with a band\nOf harpers and young men, and they\nImagined, as they struck the way\nTo many pastured Muirthemne,\nThat all things fell out happily\nAnd there, for all that fools had said,\nBaile and Aillinn would be wed.\nThey found an old man running there,\nHe had ragged long grass-yellow hair;\np.17\nHe had knees that stuck out of his hose;\nHe had puddle water in his shoes;\nHe had half a cloak to keep him dry;\nAlthough he had a squirrel's eye.\nO wandering birds and rushy beds,\nYou put such folly in our heads\nWith all this crying in the wind\nNo common love is to our mind,\nAnd our poor Kate or Nan is less\nThan any whose unhappiness\nAwoke the harp strings long ago.\nYet they that know all things but know\nThat all life had to give us is\nA child's laughter, a woman s kiss.\nWho was it put so great a scorn\nIn the grey reeds that night and morn\nAre trodden and broken by the herds,\nAnd in the light bodies of birds\nThat north wind tumbles to and fro\nAnd pinches among hail and snow?\nThat runner said 'I am from the south;\nI run to Baile Honey-Mouth\nTo tell him how the girl Aillinn\nRode from the country of her kin\nAnd old and young men rode with her:\nFor all that country had been astir\np.18\nIf anybody half as fair\nHad chosen a husband anywhere\nBut where it could see her every day.\nWhen they had ridden a little way\nAn old man caught the horse's head\nWith 'You must home again and wed\nWith somebody in your own land.'\nA young man cried and kissed her hand\n'O lady, wed with one of us;'\nAnd when no face grew piteous\nFor any gentle thing she spake\nShe fell and died of the heart-break.'\nBecause a lover's heart's worn out\nBeing tumbled and blown about\nBy its own blind imagining,\nAnd will believe that anything\nThat is bad enough to be true, is true,\nBaile's heart was broken in two;\nAnd he being laid upon green boughs\nWas carried to the goodly house\nWhere the hound of Ulad sat before\nThe brazen pillars of his door;\nHis face bowed low to weep the end\nOf the harper's daughter and her friend;\nFor although years had passed away\nHe always wept them on that day,\np.19\nFor on that day they had been betrayed;\nAnd now that Honey-Mouth is laid\nUnder a cairn of sleepy stone\nBefore his eyes, he has tears for none,\nAlthough he is carrying stone, but two\nFor whom the cairn's but heaped anew.\nWe hold because our memory is\nSo full of that thing and of this\nThat out of sight is out of mind.\nBut the grey rush under the wind\nAnd the grey bird with crooked bill\nHave such long memories that they still\nRemember Deirdre and her man,\nAnd when we walk with Kate or Nan\nAbout the windy water side\nOur heart can hear the voices chide.\nHow could we be so soon content\nWho know the way that Naoise went?\nAnd they have news of Deirdre's eyes\nWho being lovely was so wise,\nAh wise, my heart knows well how wise.\nNow had that old gaunt crafty one,\nGathering his cloak about him, run\nWhere Aillinn rode with waiting maids\nWho amid leafy lights and shades\np.20\nDreamed of the hands that would unlace\nTheir bodices in some dim place\nWhen they had come to the marriage bed;\nAnd harpers pondering with bowed head\nA music that had thought enough\nOf the ebb of all things to make love\nGrow gentle without sorrowings;\nAnd leather-coated men with slings\nWho peered about on every side;\nAnd amid leafy light he cried,\n'He is well out of wind and wave,\nThey have heaped the stones above his grave\nIn Muirthemne and over it\nIn changeless Ogham letters writ\nBaile that was of Rury's seed.\nBut the gods long ago decreed\nNo waiting maid should ever spread\nBaile and Aillinn's marriage bed,\nFor they should clip and clip again\nWhere wild bees hive on the Great Plain.\nTherefore it is but little news\nThat put this hurry in my shoes.'\nAnd hurrying to the south he came\nTo that high hill the herdsmen name\nThe Hill Seat of Leighin, because\nSome god or king had made the laws\np.21\nThat held the land together there,\nIn old times among the clouds of the air.\nThat old man climbed; the day grew dim;\nTwo swans came flying up to him\nLinked by a gold chain each to each\nAnd with low murmuring laughing speech\nAlighted on the windy grass.\nThey knew him: his changed body was\nTall, proud and ruddy, and light wings\nWere hovering over the harp strings\nThat Etain, Midhir's wife, had wove\nIn the hid place, being crazed by love.\nWhat shall I call them? fish that swim\nScale rubbing scale where light is dim\nBy a broad water-lily leaf;\nOr mice in the one wheaten sheaf\nForgotten at the threshing place;\nOr birds lost in the one clear space\nOf morning light in a dim sky;\nOr it may be, the eyelids of one eye\nOr the door pillars of one house,\nOr two sweet blossoming apple boughs\nThat have one shadow on the ground;\nOr the two strings that made one sound\nWhere that wise harper's finger ran;\np.22\nFor this young girl and this young man\nHave happiness without an end\nBecause they have made so good a friend.\nThey know all wonders, for they pass\nThe towery gates of Gorias\nAnd Findrias and Falias\nAnd long-forgotten Murias,\nAmong the giant kings whose hoard\nCauldron and spear and stone and sword\nWas robbed before Earth gave the wheat;\nWandering from broken street to street\nThey come where some huge watcher is\nAnd tremble with their love and kiss,\nThey know undying things, for they\nWander where earth withers away,\nThough nothing troubles the great streams\nBut light from the pale stars, and gleams\nFrom the holy orchards, where there is none\nBut fruit that is of precious stone,\nOr apples of the sun and moon.\nWhat were our praise to them: they eat\nQuiet's wild heart, like daily meat,\nWho when night thickens are afloat\nOn dappled skins in a glass boat\nFar out under a windless sky,\np.23\nWhile over them birds of Aengus fly,\nAnd over the tiller and the prow\nAnd waving white wings to and fro\nAwaken wanderings of light air\nTo stir their coverlet and their hair.\nAnd poets found, old writers say,\nA yew tree where his body lay,\nBut a wild apple hid the grass\nWith its sweet blossom where hers was;\nAnd being in good heart, because\nA better time had come again\nAfter the deaths of many men,\nAnd that long fighting at the ford,\nThey wrote on tablets of thin board.\nMade of the apple and the yew,\nAll the love stories that they knew.\nLet rush and bird cry out their fill\nOf the harper's daughter if they will,\nBeloved, l am not afraid of her\nShe is not wiser nor lovelier,\nAnd you are more high of heart than she\nFor all her wanderings over-sea;\nBut I'd have bird and rush forget\nThose other two, for never yet\nHas lover lived but longed to wive\nLike them that are no more alive."}, "45": {"title": "The mask", "author": "William Butler Yeats", "poem": "\n'Put off that mask of burning gold\nWith emerald eyes.'\n'O no, my dear, you make so bold\nTo find if hearts be wild and wise,\nAnd yet not cold.'\n'I would but find what's there to find,\nLove or deceit.'\n'It was the mask engaged your mind,\nAnd after set your heart to beat,\nNot what's behind.'\n'But lest you are my enemy,\nI must enquire.'\n'O no, my dear, let all that be,\nWhat matter, so there is but fire\nIn you, in me?'"}, "46": {"title": "His dream", "author": "William Butler Yeats", "poem": "\nI swayed upon the gaudy stern\nThe butt end of a steering oar,\nAnd everywhere that I could turn\nMen ran upon the shore.\np.25\nAnd though I would have hushed the crowd\nThere was no mother's son but said,\n'What is the figure in a shroud\nUpon a gaudy bed?'\nAnd fishes bubbling to the brim\nCried out upon that thing beneath,\nIt had such dignity of limb,\nBy the sweet name of Death.\nThough I'd my finger on my lip,\nWhat could I but take up the song?\nAnd fish and crowd and gaudy ship\nCried out the whole night long,\nCrying amid the glittering sea,\nNaming it with ecstatic breath,\nBecause it had such dignity\nBy the sweet name of Death."}, "47": {"title": "A woman Homer sung", "author": "William Butler Yeats", "poem": "\nIf any man drew near\nWhen I was young,\nI thought, 'He holds her dear,'\nAnd shook with hate and fear.\nBut oh, 't was bitter wrong\nIf he could pass her by\nWith an indifferent eye.\np.26\nWhereon I wrote and wrought,\nAnd now, being gray,\nI dream that I have brought\nTo such a pitch my thought\nThat coming time can say,\n'He shadowed in a glass\nWhat thing her body was.'\nFor she had fiery blood\nWhen I was young,\nAnd trod so sweetly proud\nAs 't were upon a cloud,\nA woman Homer sung,\nThat life and letters seem\nBut an heroic dream."}, "48": {"title": "Peace", "author": "William Butler Yeats", "poem": "\nAh, but Time has touched a form\nThat could show what Homer's age\nBred to be a hero's wage.\n'Were not all her life but storm,\nWould not painters paint a form\nOf such noble lines' I said.\n'Such a delicate high head,\nSo much sternness and such charm,\nTill they had changed us to like strength?'\nAh, but peace that comes at length,\nCame when Time had touched her form."}, "49": {"title": "The consolation", "author": "William Butler Yeats", "poem": "\nI had this thought awhile ago,\n'My darling cannot understand\nWhat I have done, or what would do\nIn this blind bitter land.'\nAnd I grew weary of the sun\nUntil my thoughts cleared up again,\nRemembering that the best I have done\nWas done to make it plain;\nThat every year I have cried, 'At length\nMy darling understands it all,\nBecause I have come into my strength,\nAnd words obey my call.'\nThat had she done so who can say\nWhat would have shaken from the sieve?\nI might have thrown poor words away\nAnd been content to live."}, "50": {"title": "No second Troy", "author": "William Butler Yeats", "poem": "\nWhy should I blame her that she filled my days\nWith misery, or that she would of late\nHave taught to ignorant men most violent ways,\nOr hurled the little streets upon the great,\np.28\nHad they but courage equal to desire?\nWhat could have made her peaceful with a mind\nThat nobleness made simple as a fire,\nWith beauty like a tightened bow, a kind\nThat is not natural in an age like this,\nBeing high and solitary and most stern?\nWhy, what could she have done being what she is?\nWas there another Troy for her to burn?"}, "51": {"title": "Reconciliation", "author": "William Butler Yeats", "poem": "\nSome may have blamed you that you took away\nThe verses that could move them on the day\nWhen, the ears being deafened, the sight of the eyes blind\nWith lightning you went from me, and I could find\nNothing to make a song about but kings,\nHelmets, and swords, and half-forgotten things\nThat were like memories of you\u0097but now\nWe'll out, for the world lives as long ago;\nAnd while we're in our laughing, weeping fit,\nHurl helmets, crowns, and swords into the pit.\nBut, dear, cling close to me; since you were gone,\nMy barren thoughts have chilled me to the bone."}, "52": {"title": "King and No King", "author": "William Butler Yeats", "poem": "\n'Would it were anything but merely voice !'\nThe No King cried who after that was King,\nBecause he had not heard of anything\nThat balanced with a word is more than noise;\np.29\nYet Old Romance being kind, let him prevail\nSomewhere or somehow that I have forgot,\nThough he'd but cannon\u0097Whereas we that had thought\nTo have lit upon as clean and sweet a tale\nHave been defeated by that pledge you gave\nIn momentary anger long ago;\nAnd I that have not your faith, how shall I know\nThat in the blinding light beyond the grave\nWe'll find so good a thing as that we have lost?\nThe hourly kindness, the day's common speech,\nThe habitual content of each with each\nWhen neither soul nor body has been crossed."}, "53": {"title": "Against unworthy praise", "author": "William Butler Yeats", "poem": "\nO heart, be at peace, because\nNor knave nor dolt can break\nWhat 's not for their applause,\nBeing for a woman's sake.\nEnough if the work has seemed,\nSo did she your strength renew,\nA dream that a lion had dreamed\nTill the wilderness cried aloud,\nA secret between you two,\nBetween the proud and the proud.\nWhat, still you would have their praise!\nBut here's a haughtier text,\np.30\nThe labyrinth of her days\nThat her own strangeness perplexed;\nAnd how what her dreaming gave\nEarned slander, ingratitude,\nFrom self-same dolt and knave;\nAye, and worse wrong than these.\nYet she, singing upon her road,\nHalf lion, half child, is at peace."}}